VDowbensky/efr32_baremetal/baremetal_test/chip/efr32fg1v_rac.h
/***************************************************************************//**
 * @file
 * @brief EFR32FG1V_CRC register and bit field definitions
 *******************************************************************************
 * # License
 * <b>Copyright 2020 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 ******************************************************************************/

#if defined(__ICCARM__)
#pragma system_include       /* Treat file as system include file. */
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
#pragma clang system_header  /* Treat file as system include file. */
#endif

/***************************************************************************//**
 * @addtogroup Parts
 * @{
 ******************************************************************************/
/***************************************************************************//**
 * @defgroup EFR32FG1V_RAC
 * @{
 * @brief EFR32FG1V_RAC Register Declaration
 ******************************************************************************/
/* =========================================================================================================================== */
/* ================                                            RAC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Radio controller (RAC)
  */

typedef struct {                                /*!< (@ 0x40084000) RAC Structure                                              */
  __IOM uint32_t  RXENSRCEN;                    /*!< (@ 0x00000000) RXENSRCEN                                                  */
  __IM  uint32_t  STATUS;                       /*!< (@ 0x00000004) STATUS                                                     */
  __OM  uint32_t  CMD;                          /*!< (@ 0x00000008) CMD                                                        */
  __IOM uint32_t  CTRL;                         /*!< (@ 0x0000000C) CTRL                                                       */
  __IOM uint32_t  FORCESTATE;                   /*!< (@ 0x00000010) FORCESTATE                                                 */
  __IM  uint32_t  IF;                           /*!< (@ 0x00000014) IF                                                         */
  __OM  uint32_t  IFS;                          /*!< (@ 0x00000018) IFS                                                        */
  __OM  uint32_t  IFC;                          /*!< (@ 0x0000001C) IFC                                                        */
  __IOM uint32_t  IEN;                          /*!< (@ 0x00000020) IEN                                                        */
  __IOM uint32_t  LVDSCTRL;                     /*!< (@ 0x00000024) LVDSCTRL                                                   */
  __IOM uint32_t  LVDSIDLESEQ;                  /*!< (@ 0x00000028) LVDSIDLESEQ                                                */
  __IOM uint32_t  LVDSROUTE;                    /*!< (@ 0x0000002C) LVDSROUTE                                                  */
  __IOM uint32_t  HFXORETIMECTRL;               /*!< (@ 0x00000030) HFXORETIMECTRL                                             */
  __IM  uint32_t  HFXORETIMESTATUS;             /*!< (@ 0x00000034) HFXORETIMESTATUS                                           */
  __IOM uint32_t  TESTCTRL;                     /*!< (@ 0x00000038) TESTCTRL                                                   */
  __IM  uint32_t  SEQSTATUS;                    /*!< (@ 0x0000003C) SEQSTATUS                                                  */
  __OM  uint32_t  SEQCMD;                       /*!< (@ 0x00000040) SEQCMD                                                     */
  __IOM uint32_t  BREAKPOINT;                   /*!< (@ 0x00000044) BREAKPOINT                                                 */
  __IOM uint32_t  R0;                           /*!< (@ 0x00000048) R0                                                         */
  __IOM uint32_t  R1;                           /*!< (@ 0x0000004C) R1                                                         */
  __IOM uint32_t  R2;                           /*!< (@ 0x00000050) R2                                                         */
  __IOM uint32_t  R3;                           /*!< (@ 0x00000054) R3                                                         */
  __IOM uint32_t  R4;                           /*!< (@ 0x00000058) R4                                                         */
  __IOM uint32_t  R5;                           /*!< (@ 0x0000005C) R5                                                         */
  __IOM uint32_t  R6;                           /*!< (@ 0x00000060) R6                                                         */
  __IOM uint32_t  R7;                           /*!< (@ 0x00000064) R7                                                         */
  __IM  uint32_t  RESERVED;
  __IM  uint32_t  WAITMASK;                     /*!< (@ 0x0000006C) WAITMASK                                                   */
  __IM  uint32_t  WAITSNSH;                     /*!< (@ 0x00000070) WAITSNSH                                                   */
  __IM  uint32_t  STIMER;                       /*!< (@ 0x00000074) STIMER                                                     */
  __IOM uint32_t  STIMERCOMP;                   /*!< (@ 0x00000078) STIMERCOMP                                                 */
  __IOM uint32_t  VECTADDR;                     /*!< (@ 0x0000007C) VECTADDR                                                   */
  __IOM uint32_t  SEQCTRL;                      /*!< (@ 0x00000080) SEQCTRL                                                    */
  __IOM uint32_t  PRESC;                        /*!< (@ 0x00000084) PRESC                                                      */
  __IOM uint32_t  SR0;                          /*!< (@ 0x00000088) SR0                                                        */
  __IOM uint32_t  SR1;                          /*!< (@ 0x0000008C) SR1                                                        */
  __IOM uint32_t  SR2;                          /*!< (@ 0x00000090) SR2                                                        */
  __IOM uint32_t  SR3;                          /*!< (@ 0x00000094) SR3                                                        */
  __IOM uint32_t  SYNTHENCTRL;                  /*!< (@ 0x00000098) SYNTHENCTRL                                                */
  __IOM uint32_t  SYNTHREGCTRL;                 /*!< (@ 0x0000009C) SYNTHREGCTRL                                               */
  __IOM uint32_t  VCOCTRL;                      /*!< (@ 0x000000A0) VCOCTRL                                                    */
  __IOM uint32_t  MMDCTRL;                      /*!< (@ 0x000000A4) MMDCTRL                                                    */
  __IM  uint32_t  RESERVED1[2];
  __IOM uint32_t  CHPCTRL;                      /*!< (@ 0x000000B0) CHPCTRL                                                    */
  __IOM uint32_t  CHPCAL;                       /*!< (@ 0x000000B4) CHPCAL                                                     */
  __IOM uint32_t  LPFCTRL;                      /*!< (@ 0x000000B8) LPFCTRL                                                    */
  __IOM uint32_t  SYNTHCTRL;                    /*!< (@ 0x000000BC) SYNTHCTRL                                                  */
  __IOM uint32_t  AUXCTRL;                      /*!< (@ 0x000000C0) AUXCTRL                                                    */
  __IOM uint32_t  AUXENCTRL;                    /*!< (@ 0x000000C4) AUXENCTRL                                                  */
  __IM  uint32_t  RESERVED2[11];
  __IOM uint32_t  RFENCTRL;                     /*!< (@ 0x000000F4) RFENCTRL                                                   */
  __IOM uint32_t  RFENCTRL0;                    /*!< (@ 0x000000F8) RFENCTRL0                                                  */
  __IOM uint32_t  LNAMIXCTRL;                   /*!< (@ 0x000000FC) LNAMIXCTRL                                                 */
  __IOM uint32_t  PACTRL0;                      /*!< (@ 0x00000100) PACTRL0                                                    */
  __IOM uint32_t  PAPKDCTRL;                    /*!< (@ 0x00000104) PAPKDCTRL                                                  */
  __IOM uint32_t  PABIASCTRL0;                  /*!< (@ 0x00000108) PABIASCTRL0                                                */
  __IOM uint32_t  PABIASCTRL1;                  /*!< (@ 0x0000010C) PABIASCTRL1                                                */
  __IOM uint32_t  SGRFENCTRL0;                  /*!< (@ 0x00000110) SGRFENCTRL0                                                */
  __IOM uint32_t  SGLNAMIXCTRL;                 /*!< (@ 0x00000114) SGLNAMIXCTRL                                               */
  __IOM uint32_t  SGPACTRL0;                    /*!< (@ 0x00000118) SGPACTRL0                                                  */
  __IOM uint32_t  SGPAPKDCTRL;                  /*!< (@ 0x0000011C) SGPAPKDCTRL                                                */
  __IOM uint32_t  SGPABIASCTRL0;                /*!< (@ 0x00000120) SGPABIASCTRL0                                              */
  __IOM uint32_t  SGPABIASCTRL1;                /*!< (@ 0x00000124) SGPABIASCTRL1                                              */
  __IM  uint32_t  RFSTATUS;                     /*!< (@ 0x00000128) RFSTATUS                                                   */
  __IOM uint32_t  RFBIASCTRL;                   /*!< (@ 0x0000012C) RFBIASCTRL                                                 */
  __IOM uint32_t  RFBIASCAL;                    /*!< (@ 0x00000130) RFBIASCAL                                                  */
  __IOM uint32_t  LNAMIXCTRL1;                  /*!< (@ 0x00000134) LNAMIXCTRL1                                                */
  __IOM uint32_t  IFPGACTRL;                    /*!< (@ 0x00000138) IFPGACTRL                                                  */
  __IOM uint32_t  IFPGACAL;                     /*!< (@ 0x0000013C) IFPGACAL                                                   */
  __IOM uint32_t  IFFILTCTRL;                   /*!< (@ 0x00000140) IFFILTCTRL                                                 */
  __IOM uint32_t  IFADCCTRL;                    /*!< (@ 0x00000144) IFADCCTRL                                                  */
  __IOM uint32_t  IFADCCAL;                     /*!< (@ 0x00000148) IFADCCAL                                                   */
  __IOM uint32_t  PAENCTRL;                     /*!< (@ 0x0000014C) PAENCTRL                                                   */
  __IOM uint32_t  PACTUNECTRL;                  /*!< (@ 0x00000150) PACTUNECTRL                                                */
  __IOM uint32_t  RCTUNE;                       /*!< (@ 0x00000154) RCTUNE                                                     */
  __IOM uint32_t  APC;                          /*!< (@ 0x00000158) APC                                                        */
  __IOM uint32_t  SPARE;                        /*!< (@ 0x0000015C) SPARE                                                      */
} RAC_Typedef;                                     /*!< Size = 352 (0x160)                                                        */
 
/***************************************************************************//**
 * @addtogroup EFR32FG1V_RAC
 * @{
 * @defgroup EFR32FG1V_RAC BitFields  RAC Bit Fields
 * @{
 ******************************************************************************/
/* =========================================================================================================================== */
/* ================                                            RAC                                            ================ */
/* =========================================================================================================================== */

/* =======================================================  RXENSRCEN  ======================================================= */
#define RAC_RXENSRCEN_SWRXEN_Pos          (0UL)                     /*!< SWRXEN (Bit 0)                                        */
#define RAC_RXENSRCEN_SWRXEN_Msk          (0xffUL)                  /*!< SWRXEN (Bitfield-Mask: 0xff)                          */
#define RAC_RXENSRCEN_CHANNELBUSYEN_Pos   (8UL)                     /*!< CHANNELBUSYEN (Bit 8)                                 */
#define RAC_RXENSRCEN_CHANNELBUSYEN_Msk   (0x100UL)                 /*!< CHANNELBUSYEN (Bitfield-Mask: 0x01)                   */
#define RAC_RXENSRCEN_TIMDETEN_Pos        (9UL)                     /*!< TIMDETEN (Bit 9)                                      */
#define RAC_RXENSRCEN_TIMDETEN_Msk        (0x200UL)                 /*!< TIMDETEN (Bitfield-Mask: 0x01)                        */
#define RAC_RXENSRCEN_PREDETEN_Pos        (10UL)                    /*!< PREDETEN (Bit 10)                                     */
#define RAC_RXENSRCEN_PREDETEN_Msk        (0x400UL)                 /*!< PREDETEN (Bitfield-Mask: 0x01)                        */
#define RAC_RXENSRCEN_FRAMEDETEN_Pos      (11UL)                    /*!< FRAMEDETEN (Bit 11)                                   */
#define RAC_RXENSRCEN_FRAMEDETEN_Msk      (0x800UL)                 /*!< FRAMEDETEN (Bitfield-Mask: 0x01)                      */
#define RAC_RXENSRCEN_DEMODRXREQEN_Pos    (12UL)                    /*!< DEMODRXREQEN (Bit 12)                                 */
#define RAC_RXENSRCEN_DEMODRXREQEN_Msk    (0x1000UL)                /*!< DEMODRXREQEN (Bitfield-Mask: 0x01)                    */
#define RAC_RXENSRCEN_PRSRXEN_Pos         (13UL)                    /*!< PRSRXEN (Bit 13)                                      */
#define RAC_RXENSRCEN_PRSRXEN_Msk         (0x2000UL)                /*!< PRSRXEN (Bitfield-Mask: 0x01)                         */
#define RAC_RXENSRCEN_PRSRXENSEL_Pos      (14UL)                    /*!< PRSRXENSEL (Bit 14)                                   */
#define RAC_RXENSRCEN_PRSRXENSEL_Msk      (0x3c000UL)               /*!< PRSRXENSEL (Bitfield-Mask: 0x0f)                      */
#define RAC_RXENSRCEN_PRSRXENEM2WU_Pos    (20UL)                    /*!< PRSRXENEM2WU (Bit 20)                                 */
#define RAC_RXENSRCEN_PRSRXENEM2WU_Msk    (0x100000UL)              /*!< PRSRXENEM2WU (Bitfield-Mask: 0x01)                    */
/* ========================================================  STATUS  ========================================================= */
#define RAC_STATUS_RXMASK_Pos             (0UL)                     /*!< RXMASK (Bit 0)                                        */
#define RAC_STATUS_RXMASK_Msk             (0xffffUL)                /*!< RXMASK (Bitfield-Mask: 0xffff)                        */
#define RAC_STATUS_FORCESTATEACTIVE_Pos   (19UL)                    /*!< FORCESTATEACTIVE (Bit 19)                             */
#define RAC_STATUS_FORCESTATEACTIVE_Msk   (0x80000UL)               /*!< FORCESTATEACTIVE (Bitfield-Mask: 0x01)                */
#define RAC_STATUS_TXAFTERFRAMEPEND_Pos   (20UL)                    /*!< TXAFTERFRAMEPEND (Bit 20)                             */
#define RAC_STATUS_TXAFTERFRAMEPEND_Msk   (0x100000UL)              /*!< TXAFTERFRAMEPEND (Bitfield-Mask: 0x01)                */
#define RAC_STATUS_TXAFTERFRAMEACTIVE_Pos (21UL)                    /*!< TXAFTERFRAMEACTIVE (Bit 21)                           */
#define RAC_STATUS_TXAFTERFRAMEACTIVE_Msk (0x200000UL)              /*!< TXAFTERFRAMEACTIVE (Bitfield-Mask: 0x01)              */
#define RAC_STATUS_STATE_Pos              (24UL)                    /*!< STATE (Bit 24)                                        */
#define RAC_STATUS_STATE_Msk              (0xf000000UL)             /*!< STATE (Bitfield-Mask: 0x0f)                           */
#define RAC_STATUS_DEMODENS_Pos           (29UL)                    /*!< DEMODENS (Bit 29)                                     */
#define RAC_STATUS_DEMODENS_Msk           (0x20000000UL)            /*!< DEMODENS (Bitfield-Mask: 0x01)                        */
#define RAC_STATUS_TXENS_Pos              (30UL)                    /*!< TXENS (Bit 30)                                        */
#define RAC_STATUS_TXENS_Msk              (0x40000000UL)            /*!< TXENS (Bitfield-Mask: 0x01)                           */
#define RAC_STATUS_RXENS_Pos              (31UL)                    /*!< RXENS (Bit 31)                                        */
#define RAC_STATUS_RXENS_Msk              (0x80000000UL)            /*!< RXENS (Bitfield-Mask: 0x01)                           */

//#define _RAC_STATUS_STATE_MASK                                        0xF000000UL                                    /**< Bit mask for RAC_STATE                      */
#define _RAC_STATUS_STATE_DEFAULT                                     0x00000000UL                                   /**< Mode DEFAULT for RAC_STATUS                 */
#define _RAC_STATUS_STATE_OFF                                         0x00000000UL                                   /**< Mode OFF for RAC_STATUS                     */
#define _RAC_STATUS_STATE_RXWARM                                      0x00000001UL                                   /**< Mode RXWARM for RAC_STATUS                  */
#define _RAC_STATUS_STATE_RXSEARCH                                    0x00000002UL                                   /**< Mode RXSEARCH for RAC_STATUS                */
#define _RAC_STATUS_STATE_RXFRAME                                     0x00000003UL                                   /**< Mode RXFRAME for RAC_STATUS                 */
#define _RAC_STATUS_STATE_RXPD                                        0x00000004UL                                   /**< Mode RXPD for RAC_STATUS                    */
#define _RAC_STATUS_STATE_RX2RX                                       0x00000005UL                                   /**< Mode RX2RX for RAC_STATUS                   */
#define _RAC_STATUS_STATE_RXOVERFLOW                                  0x00000006UL                                   /**< Mode RXOVERFLOW for RAC_STATUS              */
#define _RAC_STATUS_STATE_RX2TX                                       0x00000007UL                                   /**< Mode RX2TX for RAC_STATUS                   */
#define _RAC_STATUS_STATE_TXWARM                                      0x00000008UL                                   /**< Mode TXWARM for RAC_STATUS                  */
#define _RAC_STATUS_STATE_TX                                          0x00000009UL                                   /**< Mode TX for RAC_STATUS                      */
#define _RAC_STATUS_STATE_TXPD                                        0x0000000AUL                                   /**< Mode TXPD for RAC_STATUS                    */
#define _RAC_STATUS_STATE_TX2RX                                       0x0000000BUL                                   /**< Mode TX2RX for RAC_STATUS                   */
#define _RAC_STATUS_STATE_TX2TX                                       0x0000000CUL                                   /**< Mode TX2TX for RAC_STATUS                   */
#define _RAC_STATUS_STATE_SHUTDOWN                                    0x0000000DUL                                   /**< Mode SHUTDOWN for RAC_STATUS                */
#define _RAC_STATUS_STATE_POR                                         0x0000000EUL 

