VDowbensky/efr32_baremetal/baremetal_test/chip/efr32fg1v_rac.h
/* ==========================================================  CMD  ========================================================== */
#define RAC_CMD_TXEN_Pos                  (0UL)                     /*!< TXEN (Bit 0)                                          */
#define RAC_CMD_TXEN_Msk                  (0x1UL)                   /*!< TXEN (Bitfield-Mask: 0x01)                            */
#define RAC_CMD_FORCETX_Pos               (1UL)                     /*!< FORCETX (Bit 1)                                       */
#define RAC_CMD_FORCETX_Msk               (0x2UL)                   /*!< FORCETX (Bitfield-Mask: 0x01)                         */
#define RAC_CMD_TXONCCA_Pos               (2UL)                     /*!< TXONCCA (Bit 2)                                       */
#define RAC_CMD_TXONCCA_Msk               (0x4UL)                   /*!< TXONCCA (Bitfield-Mask: 0x01)                         */
#define RAC_CMD_CLEARTXEN_Pos             (3UL)                     /*!< CLEARTXEN (Bit 3)                                     */
#define RAC_CMD_CLEARTXEN_Msk             (0x8UL)                   /*!< CLEARTXEN (Bitfield-Mask: 0x01)                       */
#define RAC_CMD_TXAFTERFRAME_Pos          (4UL)                     /*!< TXAFTERFRAME (Bit 4)                                  */
#define RAC_CMD_TXAFTERFRAME_Msk          (0x10UL)                  /*!< TXAFTERFRAME (Bitfield-Mask: 0x01)                    */
#define RAC_CMD_TXDIS_Pos                 (5UL)                     /*!< TXDIS (Bit 5)                                         */
#define RAC_CMD_TXDIS_Msk                 (0x20UL)                  /*!< TXDIS (Bitfield-Mask: 0x01)                           */
#define RAC_CMD_CLEARRXOVERFLOW_Pos       (6UL)                     /*!< CLEARRXOVERFLOW (Bit 6)                               */
#define RAC_CMD_CLEARRXOVERFLOW_Msk       (0x40UL)                  /*!< CLEARRXOVERFLOW (Bitfield-Mask: 0x01)                 */
#define RAC_CMD_RXCAL_Pos                 (7UL)                     /*!< RXCAL (Bit 7)                                         */
#define RAC_CMD_RXCAL_Msk                 (0x80UL)                  /*!< RXCAL (Bitfield-Mask: 0x01)                           */
#define RAC_CMD_RXDIS_Pos                 (8UL)                     /*!< RXDIS (Bit 8)                                         */
#define RAC_CMD_RXDIS_Msk                 (0x100UL)                 /*!< RXDIS (Bitfield-Mask: 0x01)                           */
#define RAC_CMD_PAENSET_Pos               (12UL)                    /*!< PAENSET (Bit 12)                                      */
#define RAC_CMD_PAENSET_Msk               (0x1000UL)                /*!< PAENSET (Bitfield-Mask: 0x01)                         */
#define RAC_CMD_PAENCLEAR_Pos             (13UL)                    /*!< PAENCLEAR (Bit 13)                                    */
#define RAC_CMD_PAENCLEAR_Msk             (0x2000UL)                /*!< PAENCLEAR (Bitfield-Mask: 0x01)                       */
#define RAC_CMD_LNAENSET_Pos              (14UL)                    /*!< LNAENSET (Bit 14)                                     */
#define RAC_CMD_LNAENSET_Msk              (0x4000UL)                /*!< LNAENSET (Bitfield-Mask: 0x01)                        */
#define RAC_CMD_LNAENCLEAR_Pos            (15UL)                    /*!< LNAENCLEAR (Bit 15)                                   */
#define RAC_CMD_LNAENCLEAR_Msk            (0x8000UL)                /*!< LNAENCLEAR (Bitfield-Mask: 0x01)                      */
#define RAC_CMD_DEMODENSET_Pos            (30UL)                    /*!< DEMODENSET (Bit 30)                                   */
#define RAC_CMD_DEMODENSET_Msk            (0x40000000UL)            /*!< DEMODENSET (Bitfield-Mask: 0x01)                      */
#define RAC_CMD_DEMODENCLEAR_Pos          (31UL)                    /*!< DEMODENCLEAR (Bit 31)                                 */
#define RAC_CMD_DEMODENCLEAR_Msk          (0x80000000UL)            /*!< DEMODENCLEAR (Bitfield-Mask: 0x01)                    */
/* =========================================================  CTRL  ========================================================== */
#define RAC_CTRL_FORCEDISABLE_Pos         (0UL)                     /*!< FORCEDISABLE (Bit 0)                                  */
#define RAC_CTRL_FORCEDISABLE_Msk         (0x1UL)                   /*!< FORCEDISABLE (Bitfield-Mask: 0x01)                    */
#define RAC_CTRL_PRSTXEN_Pos              (1UL)                     /*!< PRSTXEN (Bit 1)                                       */
#define RAC_CTRL_PRSTXEN_Msk              (0x2UL)                   /*!< PRSTXEN (Bitfield-Mask: 0x01)                         */
#define RAC_CTRL_TXAFTERRX_Pos            (2UL)                     /*!< TXAFTERRX (Bit 2)                                     */
#define RAC_CTRL_TXAFTERRX_Msk            (0x4UL)                   /*!< TXAFTERRX (Bitfield-Mask: 0x01)                       */
#define RAC_CTRL_PRSMODE_Pos              (3UL)                     /*!< PRSMODE (Bit 3)                                       */
#define RAC_CTRL_PRSMODE_Msk              (0x8UL)                   /*!< PRSMODE (Bitfield-Mask: 0x01)                         */
#define RAC_CTRL_PRSCLR_Pos               (5UL)                     /*!< PRSCLR (Bit 5)                                        */
#define RAC_CTRL_PRSCLR_Msk               (0x20UL)                  /*!< PRSCLR (Bitfield-Mask: 0x01)                          */
#define RAC_CTRL_TXPOSTPONE_Pos           (6UL)                     /*!< TXPOSTPONE (Bit 6)                                    */
#define RAC_CTRL_TXPOSTPONE_Msk           (0x40UL)                  /*!< TXPOSTPONE (Bitfield-Mask: 0x01)                      */
#define RAC_CTRL_ACTIVEPOL_Pos            (7UL)                     /*!< ACTIVEPOL (Bit 7)                                     */
#define RAC_CTRL_ACTIVEPOL_Msk            (0x80UL)                  /*!< ACTIVEPOL (Bitfield-Mask: 0x01)                       */
#define RAC_CTRL_PAENPOL_Pos              (8UL)                     /*!< PAENPOL (Bit 8)                                       */
#define RAC_CTRL_PAENPOL_Msk              (0x100UL)                 /*!< PAENPOL (Bitfield-Mask: 0x01)                         */
#define RAC_CTRL_LNAENPOL_Pos             (9UL)                     /*!< LNAENPOL (Bit 9)                                      */
#define RAC_CTRL_LNAENPOL_Msk             (0x200UL)                 /*!< LNAENPOL (Bitfield-Mask: 0x01)                        */
#define RAC_CTRL_PRSRXDIS_Pos             (10UL)                    /*!< PRSRXDIS (Bit 10)                                     */
#define RAC_CTRL_PRSRXDIS_Msk             (0x400UL)                 /*!< PRSRXDIS (Bitfield-Mask: 0x01)                        */
#define RAC_CTRL_PRSRXDISSEL_Pos          (11UL)                    /*!< PRSRXDISSEL (Bit 11)                                  */
#define RAC_CTRL_PRSRXDISSEL_Msk          (0x7800UL)                /*!< PRSRXDISSEL (Bitfield-Mask: 0x0f)                     */
#define RAC_CTRL_PRSFORCETX_Pos           (16UL)                    /*!< PRSFORCETX (Bit 16)                                   */
#define RAC_CTRL_PRSFORCETX_Msk           (0x10000UL)               /*!< PRSFORCETX (Bitfield-Mask: 0x01)                      */
#define RAC_CTRL_PRSFORCETXSEL_Pos        (17UL)                    /*!< PRSFORCETXSEL (Bit 17)                                */
#define RAC_CTRL_PRSFORCETXSEL_Msk        (0x1e0000UL)              /*!< PRSFORCETXSEL (Bitfield-Mask: 0x0f)                   */
#define RAC_CTRL_PRSTXENSEL_Pos           (22UL)                    /*!< PRSTXENSEL (Bit 22)                                   */
#define RAC_CTRL_PRSTXENSEL_Msk           (0x3c00000UL)             /*!< PRSTXENSEL (Bitfield-Mask: 0x0f)                      */
#define RAC_CTRL_PRSCLRSEL_Pos            (27UL)                    /*!< PRSCLRSEL (Bit 27)                                    */
#define RAC_CTRL_PRSCLRSEL_Msk            (0x78000000UL)            /*!< PRSCLRSEL (Bitfield-Mask: 0x0f)                       */
/* ======================================================  FORCESTATE  ======================================================= */
#define RAC_FORCESTATE_FORCESTATE_Pos     (0UL)                     /*!< FORCESTATE (Bit 0)                                    */
#define RAC_FORCESTATE_FORCESTATE_Msk     (0xfUL)                   /*!< FORCESTATE (Bitfield-Mask: 0x0f)                      */
/* ==========================================================  IF  =========================================================== */
#define RAC_IF_STATECHANGE_Pos            (0UL)                     /*!< STATECHANGE (Bit 0)                                   */
#define RAC_IF_STATECHANGE_Msk            (0x1UL)                   /*!< STATECHANGE (Bitfield-Mask: 0x01)                     */
#define RAC_IF_STIMCMPEV_Pos              (1UL)                     /*!< STIMCMPEV (Bit 1)                                     */
#define RAC_IF_STIMCMPEV_Msk              (0x2UL)                   /*!< STIMCMPEV (Bitfield-Mask: 0x01)                       */
#define RAC_IF_BUSERROR_Pos               (2UL)                     /*!< BUSERROR (Bit 2)                                      */
#define RAC_IF_BUSERROR_Msk               (0x4UL)                   /*!< BUSERROR (Bitfield-Mask: 0x01)                        */
#define RAC_IF_SEQ_Pos                    (16UL)                    /*!< SEQ (Bit 16)                                          */
#define RAC_IF_SEQ_Msk                    (0xff0000UL)              /*!< SEQ (Bitfield-Mask: 0xff)                             */
#define RAC_IF_PAVHIGH_Pos                (25UL)                    /*!< PAVHIGH (Bit 25)                                      */
#define RAC_IF_PAVHIGH_Msk                (0x2000000UL)             /*!< PAVHIGH (Bitfield-Mask: 0x01)                         */
#define RAC_IF_PAVLOW_Pos                 (26UL)                    /*!< PAVLOW (Bit 26)                                       */
#define RAC_IF_PAVLOW_Msk                 (0x4000000UL)             /*!< PAVLOW (Bitfield-Mask: 0x01)                          */
#define RAC_IF_PABATHIGH_Pos              (27UL)                    /*!< PABATHIGH (Bit 27)                                    */
#define RAC_IF_PABATHIGH_Msk              (0x8000000UL)             /*!< PABATHIGH (Bitfield-Mask: 0x01)                       */
/* ==========================================================  IFS  ========================================================== */
#define RAC_IFS_STATECHANGE_Pos           (0UL)                     /*!< STATECHANGE (Bit 0)                                   */
#define RAC_IFS_STATECHANGE_Msk           (0x1UL)                   /*!< STATECHANGE (Bitfield-Mask: 0x01)                     */
#define RAC_IFS_STIMCMPEV_Pos             (1UL)                     /*!< STIMCMPEV (Bit 1)                                     */
#define RAC_IFS_STIMCMPEV_Msk             (0x2UL)                   /*!< STIMCMPEV (Bitfield-Mask: 0x01)                       */
#define RAC_IFS_BUSERROR_Pos              (2UL)                     /*!< BUSERROR (Bit 2)                                      */
#define RAC_IFS_BUSERROR_Msk              (0x4UL)                   /*!< BUSERROR (Bitfield-Mask: 0x01)                        */
#define RAC_IFS_SEQ_Pos                   (16UL)                    /*!< SEQ (Bit 16)                                          */
#define RAC_IFS_SEQ_Msk                   (0xff0000UL)              /*!< SEQ (Bitfield-Mask: 0xff)                             */
#define RAC_IFS_PAVHIGH_Pos               (25UL)                    /*!< PAVHIGH (Bit 25)                                      */
#define RAC_IFS_PAVHIGH_Msk               (0x2000000UL)             /*!< PAVHIGH (Bitfield-Mask: 0x01)                         */
#define RAC_IFS_PAVLOW_Pos                (26UL)                    /*!< PAVLOW (Bit 26)                                       */
#define RAC_IFS_PAVLOW_Msk                (0x4000000UL)             /*!< PAVLOW (Bitfield-Mask: 0x01)                          */
#define RAC_IFS_PABATHIGH_Pos             (27UL)                    /*!< PABATHIGH (Bit 27)                                    */
#define RAC_IFS_PABATHIGH_Msk             (0x8000000UL)             /*!< PABATHIGH (Bitfield-Mask: 0x01)                       */
/* ==========================================================  IFC  ========================================================== */
#define RAC_IFC_STATECHANGE_Pos           (0UL)                     /*!< STATECHANGE (Bit 0)                                   */
#define RAC_IFC_STATECHANGE_Msk           (0x1UL)                   /*!< STATECHANGE (Bitfield-Mask: 0x01)                     */
#define RAC_IFC_STIMCMPEV_Pos             (1UL)                     /*!< STIMCMPEV (Bit 1)                                     */
#define RAC_IFC_STIMCMPEV_Msk             (0x2UL)                   /*!< STIMCMPEV (Bitfield-Mask: 0x01)                       */
#define RAC_IFC_BUSERROR_Pos              (2UL)                     /*!< BUSERROR (Bit 2)                                      */
#define RAC_IFC_BUSERROR_Msk              (0x4UL)                   /*!< BUSERROR (Bitfield-Mask: 0x01)                        */
#define RAC_IFC_SEQ_Pos                   (16UL)                    /*!< SEQ (Bit 16)                                          */
#define RAC_IFC_SEQ_Msk                   (0xff0000UL)              /*!< SEQ (Bitfield-Mask: 0xff)                             */
#define RAC_IFC_PAVHIGH_Pos               (25UL)                    /*!< PAVHIGH (Bit 25)                                      */
#define RAC_IFC_PAVHIGH_Msk               (0x2000000UL)             /*!< PAVHIGH (Bitfield-Mask: 0x01)                         */
#define RAC_IFC_PAVLOW_Pos                (26UL)                    /*!< PAVLOW (Bit 26)                                       */
#define RAC_IFC_PAVLOW_Msk                (0x4000000UL)             /*!< PAVLOW (Bitfield-Mask: 0x01)                          */
#define RAC_IFC_PABATHIGH_Pos             (27UL)                    /*!< PABATHIGH (Bit 27)                                    */
#define RAC_IFC_PABATHIGH_Msk             (0x8000000UL)             /*!< PABATHIGH (Bitfield-Mask: 0x01)                       */
/* ==========================================================  IEN  ========================================================== */
#define RAC_IEN_STATECHANGE_Pos           (0UL)                     /*!< STATECHANGE (Bit 0)                                   */
#define RAC_IEN_STATECHANGE_Msk           (0x1UL)                   /*!< STATECHANGE (Bitfield-Mask: 0x01)                     */
#define RAC_IEN_STIMCMPEV_Pos             (1UL)                     /*!< STIMCMPEV (Bit 1)                                     */
#define RAC_IEN_STIMCMPEV_Msk             (0x2UL)                   /*!< STIMCMPEV (Bitfield-Mask: 0x01)                       */
#define RAC_IEN_BUSERROR_Pos              (2UL)                     /*!< BUSERROR (Bit 2)                                      */
#define RAC_IEN_BUSERROR_Msk              (0x4UL)                   /*!< BUSERROR (Bitfield-Mask: 0x01)                        */
#define RAC_IEN_SEQ_Pos                   (16UL)                    /*!< SEQ (Bit 16)                                          */
#define RAC_IEN_SEQ_Msk                   (0xff0000UL)              /*!< SEQ (Bitfield-Mask: 0xff)                             */
#define RAC_IEN_PAVHIGH_Pos               (25UL)                    /*!< PAVHIGH (Bit 25)                                      */
#define RAC_IEN_PAVHIGH_Msk               (0x2000000UL)             /*!< PAVHIGH (Bitfield-Mask: 0x01)                         */
#define RAC_IEN_PAVLOW_Pos                (26UL)                    /*!< PAVLOW (Bit 26)                                       */
#define RAC_IEN_PAVLOW_Msk                (0x4000000UL)             /*!< PAVLOW (Bitfield-Mask: 0x01)                          */
#define RAC_IEN_PABATHIGH_Pos             (27UL)                    /*!< PABATHIGH (Bit 27)                                    */
#define RAC_IEN_PABATHIGH_Msk             (0x8000000UL)             /*!< PABATHIGH (Bitfield-Mask: 0x01)                       */
/* =======================================================  LVDSCTRL  ======================================================== */
#define RAC_LVDSCTRL_LVDSEN_Pos           (0UL)                     /*!< LVDSEN (Bit 0)                                        */
#define RAC_LVDSCTRL_LVDSEN_Msk           (0x1UL)                   /*!< LVDSEN (Bitfield-Mask: 0x01)                          */
#define RAC_LVDSCTRL_LVDSCURR_Pos         (2UL)                     /*!< LVDSCURR (Bit 2)                                      */
#define RAC_LVDSCTRL_LVDSCURR_Msk         (0xcUL)                   /*!< LVDSCURR (Bitfield-Mask: 0x03)                        */
#define RAC_LVDSCTRL_LVDSTESTMODE_Pos     (4UL)                     /*!< LVDSTESTMODE (Bit 4)                                  */
#define RAC_LVDSCTRL_LVDSTESTMODE_Msk     (0x10UL)                  /*!< LVDSTESTMODE (Bitfield-Mask: 0x01)                    */
#define RAC_LVDSCTRL_LVDSTESTDATA_Pos     (5UL)                     /*!< LVDSTESTDATA (Bit 5)                                  */
#define RAC_LVDSCTRL_LVDSTESTDATA_Msk     (0x20UL)                  /*!< LVDSTESTDATA (Bitfield-Mask: 0x01)                    */
#define RAC_LVDSCTRL_LVDSCMCONFIG_Pos     (6UL)                     /*!< LVDSCMCONFIG (Bit 6)                                  */
#define RAC_LVDSCTRL_LVDSCMCONFIG_Msk     (0xc0UL)                  /*!< LVDSCMCONFIG (Bitfield-Mask: 0x03)                    */
/* ======================================================  LVDSIDLESEQ  ====================================================== */
#define RAC_LVDSIDLESEQ_LVDSIDLESEQ_Pos   (0UL)                     /*!< LVDSIDLESEQ (Bit 0)                                   */
#define RAC_LVDSIDLESEQ_LVDSIDLESEQ_Msk   (0xffUL)                  /*!< LVDSIDLESEQ (Bitfield-Mask: 0xff)                     */
/* =======================================================  LVDSROUTE  ======================================================= */
#define RAC_LVDSROUTE_LVDSPEN_Pos         (0UL)                     /*!< LVDSPEN (Bit 0)                                       */
#define RAC_LVDSROUTE_LVDSPEN_Msk         (0x1UL)                   /*!< LVDSPEN (Bitfield-Mask: 0x01)                         */
#define RAC_LVDSROUTE_LVDSLOCATION_Pos    (8UL)                     /*!< LVDSLOCATION (Bit 8)                                  */
#define RAC_LVDSROUTE_LVDSLOCATION_Msk    (0x100UL)                 /*!< LVDSLOCATION (Bitfield-Mask: 0x01)                    */
/* ====================================================  HFXORETIMECTRL  ===================================================== */
#define RAC_HFXORETIMECTRL_EN_Pos         (0UL)                     /*!< EN (Bit 0)                                            */
#define RAC_HFXORETIMECTRL_EN_Msk         (0x1UL)                   /*!< EN (Bitfield-Mask: 0x01)                              */
#define RAC_HFXORETIMECTRL_DIS_Pos        (1UL)                     /*!< DIS (Bit 1)                                           */
#define RAC_HFXORETIMECTRL_DIS_Msk        (0x2UL)                   /*!< DIS (Bitfield-Mask: 0x01)                             */
#define RAC_HFXORETIMECTRL_RESET_Pos      (2UL)                     /*!< RESET (Bit 2)                                         */
#define RAC_HFXORETIMECTRL_RESET_Msk      (0x4UL)                   /*!< RESET (Bitfield-Mask: 0x01)                           */
#define RAC_HFXORETIMECTRL_LIMITH_Pos     (4UL)                     /*!< LIMITH (Bit 4)                                        */
#define RAC_HFXORETIMECTRL_LIMITH_Msk     (0x70UL)                  /*!< LIMITH (Bitfield-Mask: 0x07)                          */
#define RAC_HFXORETIMECTRL_LIMITL_Pos     (8UL)                     /*!< LIMITL (Bit 8)                                        */
#define RAC_HFXORETIMECTRL_LIMITL_Msk     (0x700UL)                 /*!< LIMITL (Bitfield-Mask: 0x07)                          */
/* ===================================================  HFXORETIMESTATUS  ==================================================== */
#define RAC_HFXORETIMESTATUS_CLKSEL_Pos   (0UL)                     /*!< CLKSEL (Bit 0)                                        */
#define RAC_HFXORETIMESTATUS_CLKSEL_Msk   (0x1UL)                   /*!< CLKSEL (Bitfield-Mask: 0x01)                          */
#define RAC_HFXORETIMESTATUS_RERESETN_Pos (1UL)                     /*!< RERESETN (Bit 1)                                      */
#define RAC_HFXORETIMESTATUS_RERESETN_Msk (0x2UL)                   /*!< RERESETN (Bitfield-Mask: 0x01)                        */
/* =======================================================  TESTCTRL  ======================================================== */
#define RAC_TESTCTRL_MODEN_Pos            (0UL)                     /*!< MODEN (Bit 0)                                         */
#define RAC_TESTCTRL_MODEN_Msk            (0x1UL)                   /*!< MODEN (Bitfield-Mask: 0x01)                           */
#define RAC_TESTCTRL_DEMODEN_Pos          (1UL)                     /*!< DEMODEN (Bit 1)                                       */
#define RAC_TESTCTRL_DEMODEN_Msk          (0x2UL)                   /*!< DEMODEN (Bitfield-Mask: 0x01)                         */
#define RAC_TESTCTRL_AUX2RFSENSE_Pos      (2UL)                     /*!< AUX2RFSENSE (Bit 2)                                   */
#define RAC_TESTCTRL_AUX2RFSENSE_Msk      (0x4UL)                   /*!< AUX2RFSENSE (Bitfield-Mask: 0x01)                     */
#define RAC_TESTCTRL_LOOPBACK2LNAINPUT_Pos (3UL)                    /*!< LOOPBACK2LNAINPUT (Bit 3)                             */
#define RAC_TESTCTRL_LOOPBACK2LNAINPUT_Msk (0x8UL)                  /*!< LOOPBACK2LNAINPUT (Bitfield-Mask: 0x01)               */
#define RAC_TESTCTRL_LOOPBACK2LNAOUTPUT_Pos (4UL)                   /*!< LOOPBACK2LNAOUTPUT (Bit 4)                            */
#define RAC_TESTCTRL_LOOPBACK2LNAOUTPUT_Msk (0x10UL)                /*!< LOOPBACK2LNAOUTPUT (Bitfield-Mask: 0x01)              */
/* =======================================================  SEQSTATUS  ======================================================= */
#define RAC_SEQSTATUS_STOPPED_Pos         (0UL)                     /*!< STOPPED (Bit 0)                                       */
#define RAC_SEQSTATUS_STOPPED_Msk         (0x1UL)                   /*!< STOPPED (Bitfield-Mask: 0x01)                         */
#define RAC_SEQSTATUS_BKPT_Pos            (1UL)                     /*!< BKPT (Bit 1)                                          */
#define RAC_SEQSTATUS_BKPT_Msk            (0x2UL)                   /*!< BKPT (Bitfield-Mask: 0x01)                            */
#define RAC_SEQSTATUS_WAITING_Pos         (2UL)                     /*!< WAITING (Bit 2)                                       */
#define RAC_SEQSTATUS_WAITING_Msk         (0x4UL)                   /*!< WAITING (Bitfield-Mask: 0x01)                         */
#define RAC_SEQSTATUS_WAITMODE_Pos        (3UL)                     /*!< WAITMODE (Bit 3)                                      */
#define RAC_SEQSTATUS_WAITMODE_Msk        (0x8UL)                   /*!< WAITMODE (Bitfield-Mask: 0x01)                        */
#define RAC_SEQSTATUS_DONE_Pos            (4UL)                     /*!< DONE (Bit 4)                                          */
#define RAC_SEQSTATUS_DONE_Msk            (0x10UL)                  /*!< DONE (Bitfield-Mask: 0x01)                            */
#define RAC_SEQSTATUS_NEG_Pos             (5UL)                     /*!< NEG (Bit 5)                                           */
#define RAC_SEQSTATUS_NEG_Msk             (0x20UL)                  /*!< NEG (Bitfield-Mask: 0x01)                             */
