VDowbensky/efr32_baremetal/baremetal_test/chip/efr32fg1v_rac.h
#define RAC_SEQSTATUS_POS_Pos             (6UL)                     /*!< POS (Bit 6)                                           */
#define RAC_SEQSTATUS_POS_Msk             (0x40UL)                  /*!< POS (Bitfield-Mask: 0x01)                             */
#define RAC_SEQSTATUS_ZERO_Pos            (7UL)                     /*!< ZERO (Bit 7)                                          */
#define RAC_SEQSTATUS_ZERO_Msk            (0x80UL)                  /*!< ZERO (Bitfield-Mask: 0x01)                            */
#define RAC_SEQSTATUS_CARRY_Pos           (8UL)                     /*!< CARRY (Bit 8)                                         */
#define RAC_SEQSTATUS_CARRY_Msk           (0x100UL)                 /*!< CARRY (Bitfield-Mask: 0x01)                           */
#define RAC_SEQSTATUS_ABORTEN_Pos         (10UL)                    /*!< ABORTEN (Bit 10)                                      */
#define RAC_SEQSTATUS_ABORTEN_Msk         (0x400UL)                 /*!< ABORTEN (Bitfield-Mask: 0x01)                         */
/* ========================================================  SEQCMD  ========================================================= */
#define RAC_SEQCMD_HALT_Pos               (0UL)                     /*!< HALT (Bit 0)                                          */
#define RAC_SEQCMD_HALT_Msk               (0x1UL)                   /*!< HALT (Bitfield-Mask: 0x01)                            */
#define RAC_SEQCMD_STEP_Pos               (1UL)                     /*!< STEP (Bit 1)                                          */
#define RAC_SEQCMD_STEP_Msk               (0x2UL)                   /*!< STEP (Bitfield-Mask: 0x01)                            */
#define RAC_SEQCMD_RESUME_Pos             (2UL)                     /*!< RESUME (Bit 2)                                        */
#define RAC_SEQCMD_RESUME_Msk             (0x4UL)                   /*!< RESUME (Bitfield-Mask: 0x01)                          */
#define RAC_SEQCMD_BKPTEN_Pos             (3UL)                     /*!< BKPTEN (Bit 3)                                        */
#define RAC_SEQCMD_BKPTEN_Msk             (0x8UL)                   /*!< BKPTEN (Bitfield-Mask: 0x01)                          */
#define RAC_SEQCMD_BKPTDIS_Pos            (4UL)                     /*!< BKPTDIS (Bit 4)                                       */
#define RAC_SEQCMD_BKPTDIS_Msk            (0x10UL)                  /*!< BKPTDIS (Bitfield-Mask: 0x01)                         */
#define RAC_SEQCMD_ABORT_Pos              (5UL)                     /*!< ABORT (Bit 5)                                         */
#define RAC_SEQCMD_ABORT_Msk              (0x20UL)                  /*!< ABORT (Bitfield-Mask: 0x01)                           */
#define RAC_SEQCMD_ABORTENSET_Pos         (6UL)                     /*!< ABORTENSET (Bit 6)                                    */
#define RAC_SEQCMD_ABORTENSET_Msk         (0x40UL)                  /*!< ABORTENSET (Bitfield-Mask: 0x01)                      */
#define RAC_SEQCMD_ABORTENCLEAR_Pos       (7UL)                     /*!< ABORTENCLEAR (Bit 7)                                  */
#define RAC_SEQCMD_ABORTENCLEAR_Msk       (0x80UL)                  /*!< ABORTENCLEAR (Bitfield-Mask: 0x01)                    */
/* ======================================================  BREAKPOINT  ======================================================= */
#define RAC_BREAKPOINT_BKPADDR_Pos        (0UL)                     /*!< BKPADDR (Bit 0)                                       */
#define RAC_BREAKPOINT_BKPADDR_Msk        (0xffffffffUL)            /*!< BKPADDR (Bitfield-Mask: 0xffffffff)                   */
/* ==========================================================  R0  =========================================================== */
#define RAC_R0_R0_Pos                     (0UL)                     /*!< R0 (Bit 0)                                            */
#define RAC_R0_R0_Msk                     (0xffffffffUL)            /*!< R0 (Bitfield-Mask: 0xffffffff)                        */
/* ==========================================================  R1  =========================================================== */
#define RAC_R1_R1_Pos                     (0UL)                     /*!< R1 (Bit 0)                                            */
#define RAC_R1_R1_Msk                     (0xffffffffUL)            /*!< R1 (Bitfield-Mask: 0xffffffff)                        */
/* ==========================================================  R2  =========================================================== */
#define RAC_R2_R2_Pos                     (0UL)                     /*!< R2 (Bit 0)                                            */
#define RAC_R2_R2_Msk                     (0xffffffffUL)            /*!< R2 (Bitfield-Mask: 0xffffffff)                        */
/* ==========================================================  R3  =========================================================== */
#define RAC_R3_R3_Pos                     (0UL)                     /*!< R3 (Bit 0)                                            */
#define RAC_R3_R3_Msk                     (0xffffffffUL)            /*!< R3 (Bitfield-Mask: 0xffffffff)                        */
/* ==========================================================  R4  =========================================================== */
#define RAC_R4_R4_Pos                     (0UL)                     /*!< R4 (Bit 0)                                            */
#define RAC_R4_R4_Msk                     (0xffffffffUL)            /*!< R4 (Bitfield-Mask: 0xffffffff)                        */
/* ==========================================================  R5  =========================================================== */
#define RAC_R5_R5_Pos                     (0UL)                     /*!< R5 (Bit 0)                                            */
#define RAC_R5_R5_Msk                     (0xffffffffUL)            /*!< R5 (Bitfield-Mask: 0xffffffff)                        */
/* ==========================================================  R6  =========================================================== */
#define RAC_R6_R6_Pos                     (0UL)                     /*!< R6 (Bit 0)                                            */
#define RAC_R6_R6_Msk                     (0xffffffffUL)            /*!< R6 (Bitfield-Mask: 0xffffffff)                        */
/* ==========================================================  R7  =========================================================== */
#define RAC_R7_R7_Pos                     (0UL)                     /*!< R7 (Bit 0)                                            */
#define RAC_R7_R7_Msk                     (0xffffffffUL)            /*!< R7 (Bitfield-Mask: 0xffffffff)                        */
/* =======================================================  WAITMASK  ======================================================== */
#define RAC_WAITMASK_STCMP_Pos            (0UL)                     /*!< STCMP (Bit 0)                                         */
#define RAC_WAITMASK_STCMP_Msk            (0x1UL)                   /*!< STCMP (Bitfield-Mask: 0x01)                           */
#define RAC_WAITMASK_FRCRX_Pos            (1UL)                     /*!< FRCRX (Bit 1)                                         */
#define RAC_WAITMASK_FRCRX_Msk            (0x2UL)                   /*!< FRCRX (Bitfield-Mask: 0x01)                           */
#define RAC_WAITMASK_FRCTX_Pos            (2UL)                     /*!< FRCTX (Bit 2)                                         */
#define RAC_WAITMASK_FRCTX_Msk            (0x4UL)                   /*!< FRCTX (Bitfield-Mask: 0x01)                           */
#define RAC_WAITMASK_PRSEVENT_Pos         (3UL)                     /*!< PRSEVENT (Bit 3)                                      */
#define RAC_WAITMASK_PRSEVENT_Msk         (0x8UL)                   /*!< PRSEVENT (Bitfield-Mask: 0x01)                        */
#define RAC_WAITMASK_DEMODRXREQCLR_Pos    (4UL)                     /*!< DEMODRXREQCLR (Bit 4)                                 */
#define RAC_WAITMASK_DEMODRXREQCLR_Msk    (0x10UL)                  /*!< DEMODRXREQCLR (Bitfield-Mask: 0x01)                   */
#define RAC_WAITMASK_SYNTHRDY_Pos         (5UL)                     /*!< SYNTHRDY (Bit 5)                                      */
#define RAC_WAITMASK_SYNTHRDY_Msk         (0x20UL)                  /*!< SYNTHRDY (Bitfield-Mask: 0x01)                        */
#define RAC_WAITMASK_RAMPDONE_Pos         (6UL)                     /*!< RAMPDONE (Bit 6)                                      */
#define RAC_WAITMASK_RAMPDONE_Msk         (0x40UL)                  /*!< RAMPDONE (Bitfield-Mask: 0x01)                        */
#define RAC_WAITMASK_HFXORDY_Pos          (7UL)                     /*!< HFXORDY (Bit 7)                                       */
#define RAC_WAITMASK_HFXORDY_Msk          (0x80UL)                  /*!< HFXORDY (Bitfield-Mask: 0x01)                         */
#define RAC_WAITMASK_FRCPAUSED_Pos        (8UL)                     /*!< FRCPAUSED (Bit 8)                                     */
#define RAC_WAITMASK_FRCPAUSED_Msk        (0x100UL)                 /*!< FRCPAUSED (Bitfield-Mask: 0x01)                       */
/* =======================================================  WAITSNSH  ======================================================== */
#define RAC_WAITSNSH_WAITSNSH_Pos         (0UL)                     /*!< WAITSNSH (Bit 0)                                      */
#define RAC_WAITSNSH_WAITSNSH_Msk         (0x3ffUL)                 /*!< WAITSNSH (Bitfield-Mask: 0x3ff)                       */
/* ========================================================  STIMER  ========================================================= */
#define RAC_STIMER_STIMER_Pos             (0UL)                     /*!< STIMER (Bit 0)                                        */
#define RAC_STIMER_STIMER_Msk             (0xffffUL)                /*!< STIMER (Bitfield-Mask: 0xffff)                        */
/* ======================================================  STIMERCOMP  ======================================================= */
#define RAC_STIMERCOMP_STIMERCOMP_Pos     (0UL)                     /*!< STIMERCOMP (Bit 0)                                    */
#define RAC_STIMERCOMP_STIMERCOMP_Msk     (0xffffUL)                /*!< STIMERCOMP (Bitfield-Mask: 0xffff)                    */
/* =======================================================  VECTADDR  ======================================================== */
#define RAC_VECTADDR_VECTADDR_Pos         (0UL)                     /*!< VECTADDR (Bit 0)                                      */
#define RAC_VECTADDR_VECTADDR_Msk         (0xffffffffUL)            /*!< VECTADDR (Bitfield-Mask: 0xffffffff)                  */
/* ========================================================  SEQCTRL  ======================================================== */
#define RAC_SEQCTRL_COMPACT_Pos           (0UL)                     /*!< COMPACT (Bit 0)                                       */
#define RAC_SEQCTRL_COMPACT_Msk           (0x1UL)                   /*!< COMPACT (Bitfield-Mask: 0x01)                         */
#define RAC_SEQCTRL_COMPINVALMODE_Pos     (1UL)                     /*!< COMPINVALMODE (Bit 1)                                 */
#define RAC_SEQCTRL_COMPINVALMODE_Msk     (0x6UL)                   /*!< COMPINVALMODE (Bitfield-Mask: 0x03)                   */
#define RAC_SEQCTRL_PRSSEL_Pos            (4UL)                     /*!< PRSSEL (Bit 4)                                        */
#define RAC_SEQCTRL_PRSSEL_Msk            (0xf0UL)                  /*!< PRSSEL (Bitfield-Mask: 0x0f)                          */
#define RAC_SEQCTRL_STIMERDEBUGRUN_Pos    (10UL)                    /*!< STIMERDEBUGRUN (Bit 10)                               */
#define RAC_SEQCTRL_STIMERDEBUGRUN_Msk    (0x400UL)                 /*!< STIMERDEBUGRUN (Bitfield-Mask: 0x01)                  */
#define RAC_SEQCTRL_CPUHALTREQEN_Pos      (11UL)                    /*!< CPUHALTREQEN (Bit 11)                                 */
#define RAC_SEQCTRL_CPUHALTREQEN_Msk      (0x800UL)                 /*!< CPUHALTREQEN (Bitfield-Mask: 0x01)                    */
#define RAC_SEQCTRL_SEQHALTUPONCPUHALTEN_Pos (12UL)                 /*!< SEQHALTUPONCPUHALTEN (Bit 12)                         */
#define RAC_SEQCTRL_SEQHALTUPONCPUHALTEN_Msk (0x1000UL)             /*!< SEQHALTUPONCPUHALTEN (Bitfield-Mask: 0x01)            */
/* =========================================================  PRESC  ========================================================= */
#define RAC_PRESC_STIMER_Pos              (0UL)                     /*!< STIMER (Bit 0)                                        */
#define RAC_PRESC_STIMER_Msk              (0x7fUL)                  /*!< STIMER (Bitfield-Mask: 0x7f)                          */
/* ==========================================================  SR0  ========================================================== */
#define RAC_SR0_SR0_Pos                   (0UL)                     /*!< SR0 (Bit 0)                                           */
#define RAC_SR0_SR0_Msk                   (0xffffffffUL)            /*!< SR0 (Bitfield-Mask: 0xffffffff)                       */
/* ==========================================================  SR1  ========================================================== */
#define RAC_SR1_SR1_Pos                   (0UL)                     /*!< SR1 (Bit 0)                                           */
#define RAC_SR1_SR1_Msk                   (0xffffffffUL)            /*!< SR1 (Bitfield-Mask: 0xffffffff)                       */
/* ==========================================================  SR2  ========================================================== */
#define RAC_SR2_SR2_Pos                   (0UL)                     /*!< SR2 (Bit 0)                                           */
#define RAC_SR2_SR2_Msk                   (0xffffffffUL)            /*!< SR2 (Bitfield-Mask: 0xffffffff)                       */
/* ==========================================================  SR3  ========================================================== */
#define RAC_SR3_SR3_Pos                   (0UL)                     /*!< SR3 (Bit 0)                                           */
#define RAC_SR3_SR3_Msk                   (0xffffffffUL)            /*!< SR3 (Bitfield-Mask: 0xffffffff)                       */
/* ======================================================  SYNTHENCTRL  ====================================================== */
#define RAC_SYNTHENCTRL_VCOEN_Pos         (0UL)                     /*!< VCOEN (Bit 0)                                         */
#define RAC_SYNTHENCTRL_VCOEN_Msk         (0x1UL)                   /*!< VCOEN (Bitfield-Mask: 0x01)                           */
#define RAC_SYNTHENCTRL_VCOSTARTUP_Pos    (1UL)                     /*!< VCOSTARTUP (Bit 1)                                    */
#define RAC_SYNTHENCTRL_VCOSTARTUP_Msk    (0x2UL)                   /*!< VCOSTARTUP (Bitfield-Mask: 0x01)                      */
#define RAC_SYNTHENCTRL_LODIVEN_Pos       (3UL)                     /*!< LODIVEN (Bit 3)                                       */
#define RAC_SYNTHENCTRL_LODIVEN_Msk       (0x8UL)                   /*!< LODIVEN (Bitfield-Mask: 0x01)                         */
#define RAC_SYNTHENCTRL_CHPEN_Pos         (4UL)                     /*!< CHPEN (Bit 4)                                         */
#define RAC_SYNTHENCTRL_CHPEN_Msk         (0x10UL)                  /*!< CHPEN (Bitfield-Mask: 0x01)                           */
#define RAC_SYNTHENCTRL_LPFEN_Pos         (5UL)                     /*!< LPFEN (Bit 5)                                         */
#define RAC_SYNTHENCTRL_LPFEN_Msk         (0x20UL)                  /*!< LPFEN (Bitfield-Mask: 0x01)                           */
#define RAC_SYNTHENCTRL_LPFQUICKSTART_Pos (6UL)                     /*!< LPFQUICKSTART (Bit 6)                                 */
#define RAC_SYNTHENCTRL_LPFQUICKSTART_Msk (0x40UL)                  /*!< LPFQUICKSTART (Bitfield-Mask: 0x01)                   */
#define RAC_SYNTHENCTRL_VCBUFEN_Pos       (7UL)                     /*!< VCBUFEN (Bit 7)                                       */
#define RAC_SYNTHENCTRL_VCBUFEN_Msk       (0x80UL)                  /*!< VCBUFEN (Bitfield-Mask: 0x01)                         */
#define RAC_SYNTHENCTRL_SYNTHCLKEN_Pos    (8UL)                     /*!< SYNTHCLKEN (Bit 8)                                    */
#define RAC_SYNTHENCTRL_SYNTHCLKEN_Msk    (0x100UL)                 /*!< SYNTHCLKEN (Bitfield-Mask: 0x01)                      */
#define RAC_SYNTHENCTRL_SYNTHSTARTREQ_Pos (9UL)                     /*!< SYNTHSTARTREQ (Bit 9)                                 */
#define RAC_SYNTHENCTRL_SYNTHSTARTREQ_Msk (0x200UL)                 /*!< SYNTHSTARTREQ (Bitfield-Mask: 0x01)                   */
#define RAC_SYNTHENCTRL_CHPLDOEN_Pos      (10UL)                    /*!< CHPLDOEN (Bit 10)                                     */
#define RAC_SYNTHENCTRL_CHPLDOEN_Msk      (0x400UL)                 /*!< CHPLDOEN (Bitfield-Mask: 0x01)                        */
#define RAC_SYNTHENCTRL_LODIVSYNCCLKEN_Pos (11UL)                   /*!< LODIVSYNCCLKEN (Bit 11)                               */
#define RAC_SYNTHENCTRL_LODIVSYNCCLKEN_Msk (0x800UL)                /*!< LODIVSYNCCLKEN (Bitfield-Mask: 0x01)                  */
#define RAC_SYNTHENCTRL_MMDLDOEN_Pos      (13UL)                    /*!< MMDLDOEN (Bit 13)                                     */
#define RAC_SYNTHENCTRL_MMDLDOEN_Msk      (0x2000UL)                /*!< MMDLDOEN (Bitfield-Mask: 0x01)                        */
#define RAC_SYNTHENCTRL_VCOLDOEN_Pos      (14UL)                    /*!< VCOLDOEN (Bit 14)                                     */
#define RAC_SYNTHENCTRL_VCOLDOEN_Msk      (0x4000UL)                /*!< VCOLDOEN (Bitfield-Mask: 0x01)                        */
#define RAC_SYNTHENCTRL_VCODIVEN_Pos      (15UL)                    /*!< VCODIVEN (Bit 15)                                     */
#define RAC_SYNTHENCTRL_VCODIVEN_Msk      (0x8000UL)                /*!< VCODIVEN (Bitfield-Mask: 0x01)                        */
/* =====================================================  SYNTHREGCTRL  ====================================================== */
#define RAC_SYNTHREGCTRL_UNUSED3_Pos      (0UL)                     /*!< UNUSED3 (Bit 0)                                       */
#define RAC_SYNTHREGCTRL_UNUSED3_Msk      (0x1UL)                   /*!< UNUSED3 (Bitfield-Mask: 0x01)                         */
#define RAC_SYNTHREGCTRL_UNUSED1_Pos      (1UL)                     /*!< UNUSED1 (Bit 1)                                       */
#define RAC_SYNTHREGCTRL_UNUSED1_Msk      (0x2UL)                   /*!< UNUSED1 (Bitfield-Mask: 0x01)                         */
#define RAC_SYNTHREGCTRL_UNUSED2_Pos      (2UL)                     /*!< UNUSED2 (Bit 2)                                       */
#define RAC_SYNTHREGCTRL_UNUSED2_Msk      (0x4UL)                   /*!< UNUSED2 (Bitfield-Mask: 0x01)                         */
#define RAC_SYNTHREGCTRL_MMDLDOAMPBWRED_Pos (5UL)                   /*!< MMDLDOAMPBWRED (Bit 5)                                */
#define RAC_SYNTHREGCTRL_MMDLDOAMPBWRED_Msk (0x60UL)                /*!< MMDLDOAMPBWRED (Bitfield-Mask: 0x03)                  */
#define RAC_SYNTHREGCTRL_MMDLDOAMPCURR_Pos (7UL)                    /*!< MMDLDOAMPCURR (Bit 7)                                 */
#define RAC_SYNTHREGCTRL_MMDLDOAMPCURR_Msk (0x380UL)                /*!< MMDLDOAMPCURR (Bitfield-Mask: 0x07)                   */
#define RAC_SYNTHREGCTRL_MMDLDOVREFTRIM_Pos (10UL)                  /*!< MMDLDOVREFTRIM (Bit 10)                               */
#define RAC_SYNTHREGCTRL_MMDLDOVREFTRIM_Msk (0x1c00UL)              /*!< MMDLDOVREFTRIM (Bitfield-Mask: 0x07)                  */
#define RAC_SYNTHREGCTRL_VCOLDOAMPCURR_Pos (13UL)                   /*!< VCOLDOAMPCURR (Bit 13)                                */
#define RAC_SYNTHREGCTRL_VCOLDOAMPCURR_Msk (0xe000UL)               /*!< VCOLDOAMPCURR (Bitfield-Mask: 0x07)                   */
#define RAC_SYNTHREGCTRL_VCOLDOVREFTRIM_Pos (16UL)                  /*!< VCOLDOVREFTRIM (Bit 16)                               */
#define RAC_SYNTHREGCTRL_VCOLDOVREFTRIM_Msk (0x70000UL)             /*!< VCOLDOVREFTRIM (Bitfield-Mask: 0x07)                  */
#define RAC_SYNTHREGCTRL_CHPLDOAMPBWRED_Pos (19UL)                  /*!< CHPLDOAMPBWRED (Bit 19)                               */
#define RAC_SYNTHREGCTRL_CHPLDOAMPBWRED_Msk (0x180000UL)            /*!< CHPLDOAMPBWRED (Bitfield-Mask: 0x03)                  */
#define RAC_SYNTHREGCTRL_CHPLDOAMPCURR_Pos (21UL)                   /*!< CHPLDOAMPCURR (Bit 21)                                */
#define RAC_SYNTHREGCTRL_CHPLDOAMPCURR_Msk (0xe00000UL)             /*!< CHPLDOAMPCURR (Bitfield-Mask: 0x07)                   */
#define RAC_SYNTHREGCTRL_CHPLDOVREFTRIM_Pos (24UL)                  /*!< CHPLDOVREFTRIM (Bit 24)                               */
#define RAC_SYNTHREGCTRL_CHPLDOVREFTRIM_Msk (0x7000000UL)           /*!< CHPLDOVREFTRIM (Bitfield-Mask: 0x07)                  */
/* ========================================================  VCOCTRL  ======================================================== */
#define RAC_VCOCTRL_VCOAMPLITUDE_Pos      (0UL)                     /*!< VCOAMPLITUDE (Bit 0)                                  */
#define RAC_VCOCTRL_VCOAMPLITUDE_Msk      (0xfUL)                   /*!< VCOAMPLITUDE (Bitfield-Mask: 0x0f)                    */
#define RAC_VCOCTRL_VCODETAMPLITUDE_Pos   (4UL)                     /*!< VCODETAMPLITUDE (Bit 4)                               */
#define RAC_VCOCTRL_VCODETAMPLITUDE_Msk   (0xf0UL)                  /*!< VCODETAMPLITUDE (Bitfield-Mask: 0x0f)                 */
#define RAC_VCOCTRL_VCODETEN_Pos          (8UL)                     /*!< VCODETEN (Bit 8)                                      */
#define RAC_VCOCTRL_VCODETEN_Msk          (0x100UL)                 /*!< VCODETEN (Bitfield-Mask: 0x01)                        */
#define RAC_VCOCTRL_VCODETMODE_Pos        (9UL)                     /*!< VCODETMODE (Bit 9)                                    */
#define RAC_VCOCTRL_VCODETMODE_Msk        (0x200UL)                 /*!< VCODETMODE (Bitfield-Mask: 0x01)                      */
#define RAC_VCOCTRL_VCOAREGCURR_Pos       (10UL)                    /*!< VCOAREGCURR (Bit 10)                                  */
#define RAC_VCOCTRL_VCOAREGCURR_Msk       (0xc00UL)                 /*!< VCOAREGCURR (Bitfield-Mask: 0x03)                     */
#define RAC_VCOCTRL_VCOCREGCURR_Pos       (12UL)                    /*!< VCOCREGCURR (Bit 12)                                  */
#define RAC_VCOCTRL_VCOCREGCURR_Msk       (0x7000UL)                /*!< VCOCREGCURR (Bitfield-Mask: 0x07)                     */
#define RAC_VCOCTRL_UNUSED4_Pos           (22UL)                    /*!< UNUSED4 (Bit 22)                                      */
#define RAC_VCOCTRL_UNUSED4_Msk           (0xc00000UL)              /*!< UNUSED4 (Bitfield-Mask: 0x03)                         */
#define RAC_VCOCTRL_VCODIVCURR_Pos        (24UL)                    /*!< VCODIVCURR (Bit 24)                                   */
#define RAC_VCOCTRL_VCODIVCURR_Msk        (0xf000000UL)             /*!< VCODIVCURR (Bitfield-Mask: 0x0f)                      */
/* ========================================================  MMDCTRL  ======================================================== */
#define RAC_MMDCTRL_MMDDIVDCDC_Pos        (0UL)                     /*!< MMDDIVDCDC (Bit 0)                                    */
#define RAC_MMDCTRL_MMDDIVDCDC_Msk        (0x1ffUL)                 /*!< MMDDIVDCDC (Bitfield-Mask: 0x1ff)                     */
#define RAC_MMDCTRL_MMDDIVRSDCDC_Pos      (10UL)                    /*!< MMDDIVRSDCDC (Bit 10)                                 */
