VDowbensky/efr32_baremetal/baremetal_test/chip/efr32fg1v_rac.h
#define RAC_MMDCTRL_MMDDIVRSDCDC_Msk      (0xc00UL)                 /*!< MMDDIVRSDCDC (Bitfield-Mask: 0x03)                    */
#define RAC_MMDCTRL_MMDDIVRSDIG_Pos       (12UL)                    /*!< MMDDIVRSDIG (Bit 12)                                  */
#define RAC_MMDCTRL_MMDDIVRSDIG_Msk       (0x3000UL)                /*!< MMDDIVRSDIG (Bitfield-Mask: 0x03)                     */
#define RAC_MMDCTRL_MMDENDCDC_Pos         (14UL)                    /*!< MMDENDCDC (Bit 14)                                    */
#define RAC_MMDCTRL_MMDENDCDC_Msk         (0x4000UL)                /*!< MMDENDCDC (Bitfield-Mask: 0x01)                       */
#define RAC_MMDCTRL_MMDENRSDCDC_Pos       (15UL)                    /*!< MMDENRSDCDC (Bit 15)                                  */
#define RAC_MMDCTRL_MMDENRSDCDC_Msk       (0x8000UL)                /*!< MMDENRSDCDC (Bitfield-Mask: 0x01)                     */
#define RAC_MMDCTRL_MMDENRSDIG_Pos        (16UL)                    /*!< MMDENRSDIG (Bit 16)                                   */
#define RAC_MMDCTRL_MMDENRSDIG_Msk        (0x10000UL)               /*!< MMDENRSDIG (Bitfield-Mask: 0x01)                      */
/* ========================================================  CHPCTRL  ======================================================== */
#define RAC_CHPCTRL_CHPBIAS_Pos           (0UL)                     /*!< CHPBIAS (Bit 0)                                       */
#define RAC_CHPCTRL_CHPBIAS_Msk           (0x7UL)                   /*!< CHPBIAS (Bitfield-Mask: 0x07)                         */
#define RAC_CHPCTRL_CHPCURR_Pos           (3UL)                     /*!< CHPCURR (Bit 3)                                       */
#define RAC_CHPCTRL_CHPCURR_Msk           (0x38UL)                  /*!< CHPCURR (Bitfield-Mask: 0x07)                         */
#define RAC_CHPCTRL_UNUSED8_Pos           (6UL)                     /*!< UNUSED8 (Bit 6)                                       */
#define RAC_CHPCTRL_UNUSED8_Msk           (0x1c0UL)                 /*!< UNUSED8 (Bitfield-Mask: 0x07)                         */
#define RAC_CHPCTRL_UNUSED7_Pos           (9UL)                     /*!< UNUSED7 (Bit 9)                                       */
#define RAC_CHPCTRL_UNUSED7_Msk           (0x200UL)                 /*!< UNUSED7 (Bitfield-Mask: 0x01)                         */
#define RAC_CHPCTRL_UNUSED1_Pos           (10UL)                    /*!< UNUSED1 (Bit 10)                                      */
#define RAC_CHPCTRL_UNUSED1_Msk           (0x400UL)                 /*!< UNUSED1 (Bitfield-Mask: 0x01)                         */
#define RAC_CHPCTRL_UNUSED5_Pos           (11UL)                    /*!< UNUSED5 (Bit 11)                                      */
#define RAC_CHPCTRL_UNUSED5_Msk           (0x1800UL)                /*!< UNUSED5 (Bitfield-Mask: 0x03)                         */
#define RAC_CHPCTRL_UNUSED6_Pos           (13UL)                    /*!< UNUSED6 (Bit 13)                                      */
#define RAC_CHPCTRL_UNUSED6_Msk           (0x2000UL)                /*!< UNUSED6 (Bitfield-Mask: 0x01)                         */
#define RAC_CHPCTRL_CHPOUTPUTTRISTATEMODE_Pos (14UL)                /*!< CHPOUTPUTTRISTATEMODE (Bit 14)                        */
#define RAC_CHPCTRL_CHPOUTPUTTRISTATEMODE_Msk (0x4000UL)            /*!< CHPOUTPUTTRISTATEMODE (Bitfield-Mask: 0x01)           */
#define RAC_CHPCTRL_CHPSWITCHEDBIASEN_Pos (15UL)                    /*!< CHPSWITCHEDBIASEN (Bit 15)                            */
#define RAC_CHPCTRL_CHPSWITCHEDBIASEN_Msk (0x8000UL)                /*!< CHPSWITCHEDBIASEN (Bitfield-Mask: 0x01)               */
/* ========================================================  CHPCAL  ========================================================= */
#define RAC_CHPCAL_PSRC_Pos               (0UL)                     /*!< PSRC (Bit 0)                                          */
#define RAC_CHPCAL_PSRC_Msk               (0x7UL)                   /*!< PSRC (Bitfield-Mask: 0x07)                            */
#define RAC_CHPCAL_NSRC_Pos               (3UL)                     /*!< NSRC (Bit 3)                                          */
#define RAC_CHPCAL_NSRC_Msk               (0x38UL)                  /*!< NSRC (Bitfield-Mask: 0x07)                            */
/* ========================================================  LPFCTRL  ======================================================== */
#define RAC_LPFCTRL_LPFBW_Pos             (0UL)                     /*!< LPFBW (Bit 0)                                         */
#define RAC_LPFCTRL_LPFBW_Msk             (0xfUL)                   /*!< LPFBW (Bitfield-Mask: 0x0f)                           */
#define RAC_LPFCTRL_MIRACLEMODE_Pos       (4UL)                     /*!< MIRACLEMODE (Bit 4)                                   */
#define RAC_LPFCTRL_MIRACLEMODE_Msk       (0x10UL)                  /*!< MIRACLEMODE (Bitfield-Mask: 0x01)                     */
#define RAC_LPFCTRL_UNUSED9_Pos           (8UL)                     /*!< UNUSED9 (Bit 8)                                       */
#define RAC_LPFCTRL_UNUSED9_Msk           (0xf00UL)                 /*!< UNUSED9 (Bitfield-Mask: 0x0f)                         */
#define RAC_LPFCTRL_UNUSED10_Pos          (12UL)                    /*!< UNUSED10 (Bit 12)                                     */
#define RAC_LPFCTRL_UNUSED10_Msk          (0x3000UL)                /*!< UNUSED10 (Bitfield-Mask: 0x03)                        */
#define RAC_LPFCTRL_LPFINPUTCAP_Pos       (14UL)                    /*!< LPFINPUTCAP (Bit 14)                                  */
#define RAC_LPFCTRL_LPFINPUTCAP_Msk       (0xc000UL)                /*!< LPFINPUTCAP (Bitfield-Mask: 0x03)                     */
#define RAC_LPFCTRL_LPFSWITCHINGEN_Pos    (16UL)                    /*!< LPFSWITCHINGEN (Bit 16)                               */
#define RAC_LPFCTRL_LPFSWITCHINGEN_Msk    (0x10000UL)               /*!< LPFSWITCHINGEN (Bitfield-Mask: 0x01)                  */
#define RAC_LPFCTRL_LPFGNDSWITCHINGEN_Pos (17UL)                    /*!< LPFGNDSWITCHINGEN (Bit 17)                            */
#define RAC_LPFCTRL_LPFGNDSWITCHINGEN_Msk (0x20000UL)               /*!< LPFGNDSWITCHINGEN (Bitfield-Mask: 0x01)               */
/* =======================================================  SYNTHCTRL  ======================================================= */
#define RAC_SYNTHCTRL_LODIVTXEN0DBM_Pos   (1UL)                     /*!< LODIVTXEN0DBM (Bit 1)                                 */
#define RAC_SYNTHCTRL_LODIVTXEN0DBM_Msk   (0x2UL)                   /*!< LODIVTXEN0DBM (Bitfield-Mask: 0x01)                   */
#define RAC_SYNTHCTRL_LODIVTXEN_Pos       (2UL)                     /*!< LODIVTXEN (Bit 2)                                     */
#define RAC_SYNTHCTRL_LODIVTXEN_Msk       (0x4UL)                   /*!< LODIVTXEN (Bitfield-Mask: 0x01)                       */
#define RAC_SYNTHCTRL_PFDTRADMODE_Pos     (3UL)                     /*!< PFDTRADMODE (Bit 3)                                   */
#define RAC_SYNTHCTRL_PFDTRADMODE_Msk     (0x8UL)                   /*!< PFDTRADMODE (Bitfield-Mask: 0x01)                     */
#define RAC_SYNTHCTRL_MMDPOWERBALANCEDISABLE_Pos (10UL)             /*!< MMDPOWERBALANCEDISABLE (Bit 10)                       */
#define RAC_SYNTHCTRL_MMDPOWERBALANCEDISABLE_Msk (0x400UL)          /*!< MMDPOWERBALANCEDISABLE (Bitfield-Mask: 0x01)          */
/* ========================================================  AUXCTRL  ======================================================== */
#define RAC_AUXCTRL_AUXREGEN_Pos          (0UL)                     /*!< AUXREGEN (Bit 0)                                      */
#define RAC_AUXCTRL_AUXREGEN_Msk          (0x1UL)                   /*!< AUXREGEN (Bitfield-Mask: 0x01)                        */
#define RAC_AUXCTRL_VCOEN_Pos             (1UL)                     /*!< VCOEN (Bit 1)                                         */
#define RAC_AUXCTRL_VCOEN_Msk             (0x2UL)                   /*!< VCOEN (Bitfield-Mask: 0x01)                           */
#define RAC_AUXCTRL_VCOSTARTUP_Pos        (2UL)                     /*!< VCOSTARTUP (Bit 2)                                    */
#define RAC_AUXCTRL_VCOSTARTUP_Msk        (0x4UL)                   /*!< VCOSTARTUP (Bitfield-Mask: 0x01)                      */
#define RAC_AUXCTRL_CHPEN_Pos             (3UL)                     /*!< CHPEN (Bit 3)                                         */
#define RAC_AUXCTRL_CHPEN_Msk             (0x8UL)                   /*!< CHPEN (Bitfield-Mask: 0x01)                           */
#define RAC_AUXCTRL_CHPCURR_Pos           (4UL)                     /*!< CHPCURR (Bit 4)                                       */
#define RAC_AUXCTRL_CHPCURR_Msk           (0x30UL)                  /*!< CHPCURR (Bitfield-Mask: 0x03)                         */
#define RAC_AUXCTRL_LODIVEN_Pos           (6UL)                     /*!< LODIVEN (Bit 6)                                       */
#define RAC_AUXCTRL_LODIVEN_Msk           (0x40UL)                  /*!< LODIVEN (Bitfield-Mask: 0x01)                         */
#define RAC_AUXCTRL_AUXSYNTHCLKEN_Pos     (7UL)                     /*!< AUXSYNTHCLKEN (Bit 7)                                 */
#define RAC_AUXCTRL_AUXSYNTHCLKEN_Msk     (0x80UL)                  /*!< AUXSYNTHCLKEN (Bitfield-Mask: 0x01)                   */
#define RAC_AUXCTRL_LODIVSEL_Pos          (8UL)                     /*!< LODIVSEL (Bit 8)                                      */
#define RAC_AUXCTRL_LODIVSEL_Msk          (0x700UL)                 /*!< LODIVSEL (Bitfield-Mask: 0x07)                        */
#define RAC_AUXCTRL_RXAMP_Pos             (11UL)                    /*!< RXAMP (Bit 11)                                        */
#define RAC_AUXCTRL_RXAMP_Msk             (0x1f800UL)               /*!< RXAMP (Bitfield-Mask: 0x3f)                           */
#define RAC_AUXCTRL_LDOAMPCURR_Pos        (17UL)                    /*!< LDOAMPCURR (Bit 17)                                   */
#define RAC_AUXCTRL_LDOAMPCURR_Msk        (0xe0000UL)               /*!< LDOAMPCURR (Bitfield-Mask: 0x07)                      */
#define RAC_AUXCTRL_LDOVREFTRIM_Pos       (20UL)                    /*!< LDOVREFTRIM (Bit 20)                                  */
#define RAC_AUXCTRL_LDOVREFTRIM_Msk       (0x700000UL)              /*!< LDOVREFTRIM (Bitfield-Mask: 0x07)                     */
#define RAC_AUXCTRL_FPLLDIGEN_Pos         (23UL)                    /*!< FPLLDIGEN (Bit 23)                                    */
#define RAC_AUXCTRL_FPLLDIGEN_Msk         (0x800000UL)              /*!< FPLLDIGEN (Bitfield-Mask: 0x01)                       */
#define RAC_AUXCTRL_LPFRES_Pos            (24UL)                    /*!< LPFRES (Bit 24)                                       */
#define RAC_AUXCTRL_LPFRES_Msk            (0x3000000UL)             /*!< LPFRES (Bitfield-Mask: 0x03)                          */
/* =======================================================  AUXENCTRL  ======================================================= */
#define RAC_AUXENCTRL_LDOEN_Pos           (0UL)                     /*!< LDOEN (Bit 0)                                         */
#define RAC_AUXENCTRL_LDOEN_Msk           (0x1UL)                   /*!< LDOEN (Bitfield-Mask: 0x01)                           */
#define RAC_AUXENCTRL_VCBUFEN_Pos         (1UL)                     /*!< VCBUFEN (Bit 1)                                       */
#define RAC_AUXENCTRL_VCBUFEN_Msk         (0x2UL)                   /*!< VCBUFEN (Bitfield-Mask: 0x01)                         */
#define RAC_AUXENCTRL_LODIVAUXEN_Pos      (2UL)                     /*!< LODIVAUXEN (Bit 2)                                    */
#define RAC_AUXENCTRL_LODIVAUXEN_Msk      (0x4UL)                   /*!< LODIVAUXEN (Bitfield-Mask: 0x01)                      */
#define RAC_AUXENCTRL_LODIVAUXEN0DBM_Pos  (3UL)                     /*!< LODIVAUXEN0DBM (Bit 3)                                */
#define RAC_AUXENCTRL_LODIVAUXEN0DBM_Msk  (0x8UL)                   /*!< LODIVAUXEN0DBM (Bitfield-Mask: 0x01)                  */
/* =======================================================  RFENCTRL  ======================================================== */
#define RAC_RFENCTRL_IFFILTSTANDBY_Pos    (0UL)                     /*!< IFFILTSTANDBY (Bit 0)                                 */
#define RAC_RFENCTRL_IFFILTSTANDBY_Msk    (0x1UL)                   /*!< IFFILTSTANDBY (Bitfield-Mask: 0x01)                   */
#define RAC_RFENCTRL_IFFILTEREN_Pos       (1UL)                     /*!< IFFILTEREN (Bit 1)                                    */
#define RAC_RFENCTRL_IFFILTEREN_Msk       (0x2UL)                   /*!< IFFILTEREN (Bitfield-Mask: 0x01)                      */
#define RAC_RFENCTRL_PKDEN_Pos            (2UL)                     /*!< PKDEN (Bit 2)                                         */
#define RAC_RFENCTRL_PKDEN_Msk            (0x4UL)                   /*!< PKDEN (Bitfield-Mask: 0x01)                           */
#define RAC_RFENCTRL_IFPGAEN_Pos          (3UL)                     /*!< IFPGAEN (Bit 3)                                       */
#define RAC_RFENCTRL_IFPGAEN_Msk          (0x8UL)                   /*!< IFPGAEN (Bitfield-Mask: 0x01)                         */
#define RAC_RFENCTRL_IFADCEN_Pos          (4UL)                     /*!< IFADCEN (Bit 4)                                       */
#define RAC_RFENCTRL_IFADCEN_Msk          (0x10UL)                  /*!< IFADCEN (Bitfield-Mask: 0x01)                         */
#define RAC_RFENCTRL_IFADCCAPRESET_Pos    (5UL)                     /*!< IFADCCAPRESET (Bit 5)                                 */
#define RAC_RFENCTRL_IFADCCAPRESET_Msk    (0x20UL)                  /*!< IFADCCAPRESET (Bitfield-Mask: 0x01)                   */
#define RAC_RFENCTRL_IFADCCLKEN_Pos       (6UL)                     /*!< IFADCCLKEN (Bit 6)                                    */
#define RAC_RFENCTRL_IFADCCLKEN_Msk       (0x40UL)                  /*!< IFADCCLKEN (Bitfield-Mask: 0x01)                      */
#define RAC_RFENCTRL_RFBIASEN_Pos         (11UL)                    /*!< RFBIASEN (Bit 11)                                     */
#define RAC_RFENCTRL_RFBIASEN_Msk         (0x800UL)                 /*!< RFBIASEN (Bitfield-Mask: 0x01)                        */
#define RAC_RFENCTRL_DEMEN_Pos            (12UL)                    /*!< DEMEN (Bit 12)                                        */
#define RAC_RFENCTRL_DEMEN_Msk            (0x1000UL)                /*!< DEMEN (Bitfield-Mask: 0x01)                           */
#define RAC_RFENCTRL_ENABLEI_Pos          (13UL)                    /*!< ENABLEI (Bit 13)                                      */
#define RAC_RFENCTRL_ENABLEI_Msk          (0x2000UL)                /*!< ENABLEI (Bitfield-Mask: 0x01)                         */
#define RAC_RFENCTRL_ENABLEQ_Pos          (14UL)                    /*!< ENABLEQ (Bit 14)                                      */
#define RAC_RFENCTRL_ENABLEQ_Msk          (0x4000UL)                /*!< ENABLEQ (Bitfield-Mask: 0x01)                         */
#define RAC_RFENCTRL_ENLDOCLK_Pos         (15UL)                    /*!< ENLDOCLK (Bit 15)                                     */
#define RAC_RFENCTRL_ENLDOCLK_Msk         (0x8000UL)                /*!< ENLDOCLK (Bitfield-Mask: 0x01)                        */
#define RAC_RFENCTRL_ENLDOSERIES_Pos      (16UL)                    /*!< ENLDOSERIES (Bit 16)                                  */
#define RAC_RFENCTRL_ENLDOSERIES_Msk      (0x10000UL)               /*!< ENLDOSERIES (Bitfield-Mask: 0x01)                     */
#define RAC_RFENCTRL_ENLDOSHUNTI_Pos      (17UL)                    /*!< ENLDOSHUNTI (Bit 17)                                  */
#define RAC_RFENCTRL_ENLDOSHUNTI_Msk      (0x20000UL)               /*!< ENLDOSHUNTI (Bitfield-Mask: 0x01)                     */
#define RAC_RFENCTRL_ENLDOSHUNTQ_Pos      (18UL)                    /*!< ENLDOSHUNTQ (Bit 18)                                  */
#define RAC_RFENCTRL_ENLDOSHUNTQ_Msk      (0x40000UL)               /*!< ENLDOSHUNTQ (Bitfield-Mask: 0x01)                     */
#define RAC_RFENCTRL_ENLDOPGALNA_Pos      (19UL)                    /*!< ENLDOPGALNA (Bit 19)                                  */
#define RAC_RFENCTRL_ENLDOPGALNA_Msk      (0x80000UL)               /*!< ENLDOPGALNA (Bitfield-Mask: 0x01)                     */
#define RAC_RFENCTRL_ENPGA_Pos            (20UL)                    /*!< ENPGA (Bit 20)                                        */
#define RAC_RFENCTRL_ENPGA_Msk            (0x100000UL)              /*!< ENPGA (Bitfield-Mask: 0x01)                           */
/* =======================================================  RFENCTRL0  ======================================================= */
#define RAC_RFENCTRL0_LNAMIXSTANDBY_Pos   (0UL)                     /*!< LNAMIXSTANDBY (Bit 0)                                 */
#define RAC_RFENCTRL0_LNAMIXSTANDBY_Msk   (0x1UL)                   /*!< LNAMIXSTANDBY (Bitfield-Mask: 0x01)                   */
#define RAC_RFENCTRL0_LNAMIXBIASEN_Pos    (1UL)                     /*!< LNAMIXBIASEN (Bit 1)                                  */
#define RAC_RFENCTRL0_LNAMIXBIASEN_Msk    (0x2UL)                   /*!< LNAMIXBIASEN (Bitfield-Mask: 0x01)                    */
#define RAC_RFENCTRL0_LNAMIXLOBIASEN_Pos  (2UL)                     /*!< LNAMIXLOBIASEN (Bit 2)                                */
#define RAC_RFENCTRL0_LNAMIXLOBIASEN_Msk  (0x4UL)                   /*!< LNAMIXLOBIASEN (Bitfield-Mask: 0x01)                  */
#define RAC_RFENCTRL0_LNAMIXRFBIASEN_Pos  (3UL)                     /*!< LNAMIXRFBIASEN (Bit 3)                                */
#define RAC_RFENCTRL0_LNAMIXRFBIASEN_Msk  (0x8UL)                   /*!< LNAMIXRFBIASEN (Bitfield-Mask: 0x01)                  */
#define RAC_RFENCTRL0_PASTANDBY_Pos       (16UL)                    /*!< PASTANDBY (Bit 16)                                    */
#define RAC_RFENCTRL0_PASTANDBY_Msk       (0x10000UL)               /*!< PASTANDBY (Bitfield-Mask: 0x01)                       */
#define RAC_RFENCTRL0_PAEN_Pos            (17UL)                    /*!< PAEN (Bit 17)                                         */
#define RAC_RFENCTRL0_PAEN_Msk            (0x20000UL)               /*!< PAEN (Bitfield-Mask: 0x01)                            */
#define RAC_RFENCTRL0_PAOUTEN_Pos         (18UL)                    /*!< PAOUTEN (Bit 18)                                      */
#define RAC_RFENCTRL0_PAOUTEN_Msk         (0x40000UL)               /*!< PAOUTEN (Bitfield-Mask: 0x01)                         */
#define RAC_RFENCTRL0_TRSW_Pos            (19UL)                    /*!< TRSW (Bit 19)                                         */
#define RAC_RFENCTRL0_TRSW_Msk            (0x80000UL)               /*!< TRSW (Bitfield-Mask: 0x01)                            */
/* ======================================================  LNAMIXCTRL  ======================================================= */
#define RAC_LNAMIXCTRL_RF2P4BANDWIDTH_Pos (0UL)                     /*!< RF2P4BANDWIDTH (Bit 0)                                */
#define RAC_LNAMIXCTRL_RF2P4BANDWIDTH_Msk (0x1fUL)                  /*!< RF2P4BANDWIDTH (Bitfield-Mask: 0x1f)                  */
#define RAC_LNAMIXCTRL_CASCODEBIAS_Pos    (8UL)                     /*!< CASCODEBIAS (Bit 8)                                   */
#define RAC_LNAMIXCTRL_CASCODEBIAS_Msk    (0x700UL)                 /*!< CASCODEBIAS (Bitfield-Mask: 0x07)                     */
#define RAC_LNAMIXCTRL_LOBIAS_Pos         (11UL)                    /*!< LOBIAS (Bit 11)                                       */
#define RAC_LNAMIXCTRL_LOBIAS_Msk         (0x3800UL)                /*!< LOBIAS (Bitfield-Mask: 0x07)                          */
#define RAC_LNAMIXCTRL_VREG_Pos           (14UL)                    /*!< VREG (Bit 14)                                         */
#define RAC_LNAMIXCTRL_VREG_Msk           (0x1c000UL)               /*!< VREG (Bitfield-Mask: 0x07)                            */
#define RAC_LNAMIXCTRL_RFBIAS_Pos         (17UL)                    /*!< RFBIAS (Bit 17)                                       */
#define RAC_LNAMIXCTRL_RFBIAS_Msk         (0x1e0000UL)              /*!< RFBIAS (Bitfield-Mask: 0x0f)                          */
#define RAC_LNAMIXCTRL_RISEFALLATT_Pos    (21UL)                    /*!< RISEFALLATT (Bit 21)                                  */
#define RAC_LNAMIXCTRL_RISEFALLATT_Msk    (0xe00000UL)              /*!< RISEFALLATT (Bitfield-Mask: 0x07)                     */
#define RAC_LNAMIXCTRL_LNAMIXAUXSYNTHINPUTEN_Pos (26UL)             /*!< LNAMIXAUXSYNTHINPUTEN (Bit 26)                        */
#define RAC_LNAMIXCTRL_LNAMIXAUXSYNTHINPUTEN_Msk (0x4000000UL)      /*!< LNAMIXAUXSYNTHINPUTEN (Bitfield-Mask: 0x01)           */
#define RAC_LNAMIXCTRL_ENLOAD_Pos         (30UL)                    /*!< ENLOAD (Bit 30)                                       */
#define RAC_LNAMIXCTRL_ENLOAD_Msk         (0x40000000UL)            /*!< ENLOAD (Bitfield-Mask: 0x01)                          */
/* ========================================================  PACTRL0  ======================================================== */
#define RAC_PACTRL0_RF2P4PASEL_Pos        (0UL)                     /*!< RF2P4PASEL (Bit 0)                                    */
#define RAC_PACTRL0_RF2P4PASEL_Msk        (0x1UL)                   /*!< RF2P4PASEL (Bitfield-Mask: 0x01)                      */
#define RAC_PACTRL0_RF2P4PAVDDSEL_Pos     (1UL)                     /*!< RF2P4PAVDDSEL (Bit 1)                                 */
#define RAC_PACTRL0_RF2P4PAVDDSEL_Msk     (0x2UL)                   /*!< RF2P4PAVDDSEL (Bitfield-Mask: 0x01)                   */
#define RAC_PACTRL0_RF2P4RFVDDSEL_Pos     (2UL)                     /*!< RF2P4RFVDDSEL (Bit 2)                                 */
#define RAC_PACTRL0_RF2P4RFVDDSEL_Msk     (0x4UL)                   /*!< RF2P4RFVDDSEL (Bitfield-Mask: 0x01)                   */
#define RAC_PACTRL0_BOOTSTRAP_Pos         (3UL)                     /*!< BOOTSTRAP (Bit 3)                                     */
#define RAC_PACTRL0_BOOTSTRAP_Msk         (0x8UL)                   /*!< BOOTSTRAP (Bitfield-Mask: 0x01)                       */
#define RAC_PACTRL0_RF2P4VDDPADET_Pos     (4UL)                     /*!< RF2P4VDDPADET (Bit 4)                                 */
#define RAC_PACTRL0_RF2P4VDDPADET_Msk     (0x10UL)                  /*!< RF2P4VDDPADET (Bitfield-Mask: 0x01)                   */
#define RAC_PACTRL0_CASCODE_Pos           (6UL)                     /*!< CASCODE (Bit 6)                                       */
#define RAC_PACTRL0_CASCODE_Msk           (0x3fc0UL)                /*!< CASCODE (Bitfield-Mask: 0xff)                         */
#define RAC_PACTRL0_SLICE_Pos             (14UL)                    /*!< SLICE (Bit 14)                                        */
#define RAC_PACTRL0_SLICE_Msk             (0x3fc000UL)              /*!< SLICE (Bitfield-Mask: 0xff)                           */
#define RAC_PACTRL0_STRIPE_Pos            (24UL)                    /*!< STRIPE (Bit 24)                                       */
#define RAC_PACTRL0_STRIPE_Msk            (0x1f000000UL)            /*!< STRIPE (Bitfield-Mask: 0x1f)                          */
#define RAC_PACTRL0_DACGLITCHCTRL_Pos     (30UL)                    /*!< DACGLITCHCTRL (Bit 30)                                */
#define RAC_PACTRL0_DACGLITCHCTRL_Msk     (0x40000000UL)            /*!< DACGLITCHCTRL (Bitfield-Mask: 0x01)                   */
#define RAC_PACTRL0_CASCODEBYPASSEN_Pos   (31UL)                    /*!< CASCODEBYPASSEN (Bit 31)                              */
#define RAC_PACTRL0_CASCODEBYPASSEN_Msk   (0x80000000UL)            /*!< CASCODEBYPASSEN (Bitfield-Mask: 0x01)                 */
/* =======================================================  PAPKDCTRL  ======================================================= */
