VDowbensky/efr32_baremetal/baremetal_test/chip/efr32fg1v_rac.h
#define RAC_PAPKDCTRL_PKDEN_Pos           (0UL)                     /*!< PKDEN (Bit 0)                                         */
#define RAC_PAPKDCTRL_PKDEN_Msk           (0x1UL)                   /*!< PKDEN (Bitfield-Mask: 0x01)                           */
#define RAC_PAPKDCTRL_VTLSEL_Pos          (2UL)                     /*!< VTLSEL (Bit 2)                                        */
#define RAC_PAPKDCTRL_VTLSEL_Msk          (0x7cUL)                  /*!< VTLSEL (Bitfield-Mask: 0x1f)                          */
#define RAC_PAPKDCTRL_VTHSEL_Pos          (8UL)                     /*!< VTHSEL (Bit 8)                                        */
#define RAC_PAPKDCTRL_VTHSEL_Msk          (0x1f00UL)                /*!< VTHSEL (Bitfield-Mask: 0x1f)                          */
#define RAC_PAPKDCTRL_CAPSEL_Pos          (14UL)                    /*!< CAPSEL (Bit 14)                                       */
#define RAC_PAPKDCTRL_CAPSEL_Msk          (0xc000UL)                /*!< CAPSEL (Bitfield-Mask: 0x03)                          */
#define RAC_PAPKDCTRL_I2VCM_Pos           (18UL)                    /*!< I2VCM (Bit 18)                                        */
#define RAC_PAPKDCTRL_I2VCM_Msk           (0xc0000UL)               /*!< I2VCM (Bitfield-Mask: 0x03)                           */
#define RAC_PAPKDCTRL_PKDBIASTH_Pos       (22UL)                    /*!< PKDBIASTH (Bit 22)                                    */
#define RAC_PAPKDCTRL_PKDBIASTH_Msk       (0x1c00000UL)             /*!< PKDBIASTH (Bitfield-Mask: 0x07)                       */
/* ======================================================  PABIASCTRL0  ====================================================== */
#define RAC_PABIASCTRL0_LDOBIAS_Pos       (0UL)                     /*!< LDOBIAS (Bit 0)                                       */
#define RAC_PABIASCTRL0_LDOBIAS_Msk       (0x1UL)                   /*!< LDOBIAS (Bitfield-Mask: 0x01)                         */
#define RAC_PABIASCTRL0_PABIAS_Pos        (2UL)                     /*!< PABIAS (Bit 2)                                        */
#define RAC_PABIASCTRL0_PABIAS_Msk        (0xcUL)                   /*!< PABIAS (Bitfield-Mask: 0x03)                          */
#define RAC_PABIASCTRL0_BUF0BIAS_Pos      (6UL)                     /*!< BUF0BIAS (Bit 6)                                      */
#define RAC_PABIASCTRL0_BUF0BIAS_Msk      (0xc0UL)                  /*!< BUF0BIAS (Bitfield-Mask: 0x03)                        */
#define RAC_PABIASCTRL0_BUF12BIAS_Pos     (10UL)                    /*!< BUF12BIAS (Bit 10)                                    */
#define RAC_PABIASCTRL0_BUF12BIAS_Msk     (0xc00UL)                 /*!< BUF12BIAS (Bitfield-Mask: 0x03)                       */
#define RAC_PABIASCTRL0_TXPOWER_Pos       (22UL)                    /*!< TXPOWER (Bit 22)                                      */
#define RAC_PABIASCTRL0_TXPOWER_Msk       (0x400000UL)              /*!< TXPOWER (Bitfield-Mask: 0x01)                         */
#define RAC_PABIASCTRL0_CMGAIN_Pos        (23UL)                    /*!< CMGAIN (Bit 23)                                       */
#define RAC_PABIASCTRL0_CMGAIN_Msk        (0x800000UL)              /*!< CMGAIN (Bitfield-Mask: 0x01)                          */
/* ======================================================  PABIASCTRL1  ====================================================== */
#define RAC_PABIASCTRL1_VLDO_Pos          (0UL)                     /*!< VLDO (Bit 0)                                          */
#define RAC_PABIASCTRL1_VLDO_Msk          (0x7UL)                   /*!< VLDO (Bitfield-Mask: 0x07)                            */
#define RAC_PABIASCTRL1_VLDOFB_Pos        (4UL)                     /*!< VLDOFB (Bit 4)                                        */
#define RAC_PABIASCTRL1_VLDOFB_Msk        (0x30UL)                  /*!< VLDOFB (Bitfield-Mask: 0x03)                          */
#define RAC_PABIASCTRL1_VCASCODEHV_Pos    (8UL)                     /*!< VCASCODEHV (Bit 8)                                    */
#define RAC_PABIASCTRL1_VCASCODEHV_Msk    (0x700UL)                 /*!< VCASCODEHV (Bitfield-Mask: 0x07)                      */
#define RAC_PABIASCTRL1_VCASCODELV_Pos    (12UL)                    /*!< VCASCODELV (Bit 12)                                   */
#define RAC_PABIASCTRL1_VCASCODELV_Msk    (0x7000UL)                /*!< VCASCODELV (Bitfield-Mask: 0x07)                      */
#define RAC_PABIASCTRL1_RF2P4VDDPATHRESHOLD_Pos (16UL)              /*!< RF2P4VDDPATHRESHOLD (Bit 16)                          */
#define RAC_PABIASCTRL1_RF2P4VDDPATHRESHOLD_Msk (0x30000UL)         /*!< RF2P4VDDPATHRESHOLD (Bitfield-Mask: 0x03)             */
/* ======================================================  SGRFENCTRL0  ====================================================== */
#define RAC_SGRFENCTRL0_LNAMIXBIASEN_Pos  (1UL)                     /*!< LNAMIXBIASEN (Bit 1)                                  */
#define RAC_SGRFENCTRL0_LNAMIXBIASEN_Msk  (0x2UL)                   /*!< LNAMIXBIASEN (Bitfield-Mask: 0x01)                    */
#define RAC_SGRFENCTRL0_LNAMIXLOBIASEN_Pos (2UL)                    /*!< LNAMIXLOBIASEN (Bit 2)                                */
#define RAC_SGRFENCTRL0_LNAMIXLOBIASEN_Msk (0x4UL)                  /*!< LNAMIXLOBIASEN (Bitfield-Mask: 0x01)                  */
#define RAC_SGRFENCTRL0_LNAMIXRFBIASEN_Pos (3UL)                    /*!< LNAMIXRFBIASEN (Bit 3)                                */
#define RAC_SGRFENCTRL0_LNAMIXRFBIASEN_Msk (0x8UL)                  /*!< LNAMIXRFBIASEN (Bitfield-Mask: 0x01)                  */
#define RAC_SGRFENCTRL0_PASTANDBY_Pos     (16UL)                    /*!< PASTANDBY (Bit 16)                                    */
#define RAC_SGRFENCTRL0_PASTANDBY_Msk     (0x10000UL)               /*!< PASTANDBY (Bitfield-Mask: 0x01)                       */
#define RAC_SGRFENCTRL0_PAEN_Pos          (17UL)                    /*!< PAEN (Bit 17)                                         */
#define RAC_SGRFENCTRL0_PAEN_Msk          (0x20000UL)               /*!< PAEN (Bitfield-Mask: 0x01)                            */
#define RAC_SGRFENCTRL0_PAOUTEN_Pos       (18UL)                    /*!< PAOUTEN (Bit 18)                                      */
#define RAC_SGRFENCTRL0_PAOUTEN_Msk       (0x40000UL)               /*!< PAOUTEN (Bitfield-Mask: 0x01)                         */
#define RAC_SGRFENCTRL0_TRSW_Pos          (19UL)                    /*!< TRSW (Bit 19)                                         */
#define RAC_SGRFENCTRL0_TRSW_Msk          (0x80000UL)               /*!< TRSW (Bitfield-Mask: 0x01)                            */
/* =====================================================  SGLNAMIXCTRL  ====================================================== */
#define RAC_SGLNAMIXCTRL_CASCODEBIAS_Pos  (8UL)                     /*!< CASCODEBIAS (Bit 8)                                   */
#define RAC_SGLNAMIXCTRL_CASCODEBIAS_Msk  (0x700UL)                 /*!< CASCODEBIAS (Bitfield-Mask: 0x07)                     */
#define RAC_SGLNAMIXCTRL_LOBIAS_Pos       (11UL)                    /*!< LOBIAS (Bit 11)                                       */
#define RAC_SGLNAMIXCTRL_LOBIAS_Msk       (0x3800UL)                /*!< LOBIAS (Bitfield-Mask: 0x07)                          */
#define RAC_SGLNAMIXCTRL_VREG_Pos         (14UL)                    /*!< VREG (Bit 14)                                         */
#define RAC_SGLNAMIXCTRL_VREG_Msk         (0x1c000UL)               /*!< VREG (Bitfield-Mask: 0x07)                            */
#define RAC_SGLNAMIXCTRL_RFBIAS_Pos       (17UL)                    /*!< RFBIAS (Bit 17)                                       */
#define RAC_SGLNAMIXCTRL_RFBIAS_Msk       (0xe0000UL)               /*!< RFBIAS (Bitfield-Mask: 0x07)                          */
#define RAC_SGLNAMIXCTRL_RISEFALLATT_Pos  (20UL)                    /*!< RISEFALLATT (Bit 20)                                  */
#define RAC_SGLNAMIXCTRL_RISEFALLATT_Msk  (0x700000UL)              /*!< RISEFALLATT (Bitfield-Mask: 0x07)                     */
#define RAC_SGLNAMIXCTRL_SGREGAMPCURR_Pos (23UL)                    /*!< SGREGAMPCURR (Bit 23)                                 */
#define RAC_SGLNAMIXCTRL_SGREGAMPCURR_Msk (0x3800000UL)             /*!< SGREGAMPCURR (Bitfield-Mask: 0x07)                    */
#define RAC_SGLNAMIXCTRL_LNAMIXAUXSYNTHINPUTEN_Pos (26UL)           /*!< LNAMIXAUXSYNTHINPUTEN (Bit 26)                        */
#define RAC_SGLNAMIXCTRL_LNAMIXAUXSYNTHINPUTEN_Msk (0x4000000UL)    /*!< LNAMIXAUXSYNTHINPUTEN (Bitfield-Mask: 0x01)           */
#define RAC_SGLNAMIXCTRL_SGREGAMPBWRED_Pos (28UL)                   /*!< SGREGAMPBWRED (Bit 28)                                */
#define RAC_SGLNAMIXCTRL_SGREGAMPBWRED_Msk (0x30000000UL)           /*!< SGREGAMPBWRED (Bitfield-Mask: 0x03)                   */
#define RAC_SGLNAMIXCTRL_ENLOAD_Pos       (30UL)                    /*!< ENLOAD (Bit 30)                                       */
#define RAC_SGLNAMIXCTRL_ENLOAD_Msk       (0x40000000UL)            /*!< ENLOAD (Bitfield-Mask: 0x01)                          */
/* =======================================================  SGPACTRL0  ======================================================= */
#define RAC_SGPACTRL0_BOOTSTRAP_Pos       (3UL)                     /*!< BOOTSTRAP (Bit 3)                                     */
#define RAC_SGPACTRL0_BOOTSTRAP_Msk       (0x8UL)                   /*!< BOOTSTRAP (Bitfield-Mask: 0x01)                       */
#define RAC_SGPACTRL0_SGVBATDET_Pos       (5UL)                     /*!< SGVBATDET (Bit 5)                                     */
#define RAC_SGPACTRL0_SGVBATDET_Msk       (0x20UL)                  /*!< SGVBATDET (Bitfield-Mask: 0x01)                       */
#define RAC_SGPACTRL0_CASCODE_Pos         (6UL)                     /*!< CASCODE (Bit 6)                                       */
#define RAC_SGPACTRL0_CASCODE_Msk         (0x3fc0UL)                /*!< CASCODE (Bitfield-Mask: 0xff)                         */
#define RAC_SGPACTRL0_SLICE_Pos           (14UL)                    /*!< SLICE (Bit 14)                                        */
#define RAC_SGPACTRL0_SLICE_Msk           (0x3fc000UL)              /*!< SLICE (Bitfield-Mask: 0xff)                           */
#define RAC_SGPACTRL0_STRIPE_Pos          (24UL)                    /*!< STRIPE (Bit 24)                                       */
#define RAC_SGPACTRL0_STRIPE_Msk          (0x1f000000UL)            /*!< STRIPE (Bitfield-Mask: 0x1f)                          */
#define RAC_SGPACTRL0_DACGLITCHCTRL_Pos   (30UL)                    /*!< DACGLITCHCTRL (Bit 30)                                */
#define RAC_SGPACTRL0_DACGLITCHCTRL_Msk   (0x40000000UL)            /*!< DACGLITCHCTRL (Bitfield-Mask: 0x01)                   */
#define RAC_SGPACTRL0_CASCODEBYPASSEN_Pos (31UL)                    /*!< CASCODEBYPASSEN (Bit 31)                              */
#define RAC_SGPACTRL0_CASCODEBYPASSEN_Msk (0x80000000UL)            /*!< CASCODEBYPASSEN (Bitfield-Mask: 0x01)                 */
/* ======================================================  SGPAPKDCTRL  ====================================================== */
#define RAC_SGPAPKDCTRL_PKDEN_Pos         (0UL)                     /*!< PKDEN (Bit 0)                                         */
#define RAC_SGPAPKDCTRL_PKDEN_Msk         (0x1UL)                   /*!< PKDEN (Bitfield-Mask: 0x01)                           */
#define RAC_SGPAPKDCTRL_VTLSEL_Pos        (2UL)                     /*!< VTLSEL (Bit 2)                                        */
#define RAC_SGPAPKDCTRL_VTLSEL_Msk        (0x7cUL)                  /*!< VTLSEL (Bitfield-Mask: 0x1f)                          */
#define RAC_SGPAPKDCTRL_VTHSEL_Pos        (8UL)                     /*!< VTHSEL (Bit 8)                                        */
#define RAC_SGPAPKDCTRL_VTHSEL_Msk        (0x1f00UL)                /*!< VTHSEL (Bitfield-Mask: 0x1f)                          */
#define RAC_SGPAPKDCTRL_CAPSEL_Pos        (14UL)                    /*!< CAPSEL (Bit 14)                                       */
#define RAC_SGPAPKDCTRL_CAPSEL_Msk        (0xc000UL)                /*!< CAPSEL (Bitfield-Mask: 0x03)                          */
#define RAC_SGPAPKDCTRL_I2VCM_Pos         (18UL)                    /*!< I2VCM (Bit 18)                                        */
#define RAC_SGPAPKDCTRL_I2VCM_Msk         (0xc0000UL)               /*!< I2VCM (Bitfield-Mask: 0x03)                           */
#define RAC_SGPAPKDCTRL_PKDBIASTH_Pos     (22UL)                    /*!< PKDBIASTH (Bit 22)                                    */
#define RAC_SGPAPKDCTRL_PKDBIASTH_Msk     (0x1c00000UL)             /*!< PKDBIASTH (Bitfield-Mask: 0x07)                       */
/* =====================================================  SGPABIASCTRL0  ===================================================== */
#define RAC_SGPABIASCTRL0_LDOBIAS_Pos     (0UL)                     /*!< LDOBIAS (Bit 0)                                       */
#define RAC_SGPABIASCTRL0_LDOBIAS_Msk     (0x1UL)                   /*!< LDOBIAS (Bitfield-Mask: 0x01)                         */
#define RAC_SGPABIASCTRL0_PABIAS_Pos      (2UL)                     /*!< PABIAS (Bit 2)                                        */
#define RAC_SGPABIASCTRL0_PABIAS_Msk      (0xcUL)                   /*!< PABIAS (Bitfield-Mask: 0x03)                          */
#define RAC_SGPABIASCTRL0_BUF0BIAS_Pos    (6UL)                     /*!< BUF0BIAS (Bit 6)                                      */
#define RAC_SGPABIASCTRL0_BUF0BIAS_Msk    (0xc0UL)                  /*!< BUF0BIAS (Bitfield-Mask: 0x03)                        */
//#define RAC_SGPABIASCTRL0_BUF12BIAS_Pos   (12UL)                    /*!< BUF12BIAS (Bit 12)                                    */
//#define RAC_SGPABIASCTRL0_BUF12BIAS_Msk   (0x3000UL)                /*!< BUF12BIAS (Bitfield-Mask: 0x03)                       */
#define RAC_SGPABIASCTRL0_BUF12BIAS_Pos   (10UL)                    /*!< BUF12BIAS (Bit 12)                                    */
#define RAC_SGPABIASCTRL0_BUF12BIAS_Msk   (0xc00UL)                /*!< BUF12BIAS (Bitfield-Mask: 0x03)                       */

