VDowbensky/efr32_baremetal/baremetal_test/chip/efr32fg1v_rac.h
#define RAC_SGPABIASCTRL0_TXPOWER_Pos     (22UL)                    /*!< TXPOWER (Bit 22)                                      */
#define RAC_SGPABIASCTRL0_TXPOWER_Msk     (0x400000UL)              /*!< TXPOWER (Bitfield-Mask: 0x01)                         */
#define RAC_SGPABIASCTRL0_CMGAIN_Pos      (23UL)                    /*!< CMGAIN (Bit 23)                                       */
#define RAC_SGPABIASCTRL0_CMGAIN_Msk      (0x800000UL)              /*!< CMGAIN (Bitfield-Mask: 0x01)                          */
#define RAC_SGPABIASCTRL0_SGDACFILTBANDWIDTH_Pos (24UL)             /*!< SGDACFILTBANDWIDTH (Bit 24)                           */
#define RAC_SGPABIASCTRL0_SGDACFILTBANDWIDTH_Msk (0x7000000UL)      /*!< SGDACFILTBANDWIDTH (Bitfield-Mask: 0x07)              */
/* =====================================================  SGPABIASCTRL1  ===================================================== */
#define RAC_SGPABIASCTRL1_VLDO_Pos        (0UL)                     /*!< VLDO (Bit 0)                                          */
#define RAC_SGPABIASCTRL1_VLDO_Msk        (0x7UL)                   /*!< VLDO (Bitfield-Mask: 0x07)                            */
#define RAC_SGPABIASCTRL1_VLDOFB_Pos      (4UL)                     /*!< VLDOFB (Bit 4)                                        */
#define RAC_SGPABIASCTRL1_VLDOFB_Msk      (0x30UL)                  /*!< VLDOFB (Bitfield-Mask: 0x03)                          */
#define RAC_SGPABIASCTRL1_VCASCODEHV_Pos  (8UL)                     /*!< VCASCODEHV (Bit 8)                                    */
#define RAC_SGPABIASCTRL1_VCASCODEHV_Msk  (0x700UL)                 /*!< VCASCODEHV (Bitfield-Mask: 0x07)                      */
#define RAC_SGPABIASCTRL1_VCASCODELV_Pos  (12UL)                    /*!< VCASCODELV (Bit 12)                                   */
#define RAC_SGPABIASCTRL1_VCASCODELV_Msk  (0x7000UL)                /*!< VCASCODELV (Bitfield-Mask: 0x07)                      */
#define RAC_SGPABIASCTRL1_SGVBATDETTHRESHOLD_Pos (18UL)             /*!< SGVBATDETTHRESHOLD (Bit 18)                           */
#define RAC_SGPABIASCTRL1_SGVBATDETTHRESHOLD_Msk (0xc0000UL)        /*!< SGVBATDETTHRESHOLD (Bitfield-Mask: 0x03)              */
#define RAC_SGPABIASCTRL1_SGTRIMLOWVBATCURR_Pos (20UL)              /*!< SGTRIMLOWVBATCURR (Bit 20)                            */
#define RAC_SGPABIASCTRL1_SGTRIMLOWVBATCURR_Msk (0x100000UL)        /*!< SGTRIMLOWVBATCURR (Bitfield-Mask: 0x01)               */
/* =======================================================  RFSTATUS  ======================================================== */
#define RAC_RFSTATUS_MODRAMPUPDONE_Pos    (0UL)                     /*!< MODRAMPUPDONE (Bit 0)                                 */
#define RAC_RFSTATUS_MODRAMPUPDONE_Msk    (0x1UL)                   /*!< MODRAMPUPDONE (Bitfield-Mask: 0x01)                   */
#define RAC_RFSTATUS_PAVHIGH_Pos          (1UL)                     /*!< PAVHIGH (Bit 1)                                       */
#define RAC_RFSTATUS_PAVHIGH_Msk          (0x2UL)                   /*!< PAVHIGH (Bitfield-Mask: 0x01)                         */
#define RAC_RFSTATUS_PAVLOW_Pos           (2UL)                     /*!< PAVLOW (Bit 2)                                        */
#define RAC_RFSTATUS_PAVLOW_Msk           (0x4UL)                   /*!< PAVLOW (Bitfield-Mask: 0x01)                          */
#define RAC_RFSTATUS_PABATHIGH_Pos        (3UL)                     /*!< PABATHIGH (Bit 3)                                     */
#define RAC_RFSTATUS_PABATHIGH_Msk        (0x8UL)                   /*!< PABATHIGH (Bitfield-Mask: 0x01)                       */
/* ======================================================  RFBIASCTRL  ======================================================= */
#define RAC_RFBIASCTRL_LDOVREF_Pos        (0UL)                     /*!< LDOVREF (Bit 0)                                       */
#define RAC_RFBIASCTRL_LDOVREF_Msk        (0x7UL)                   /*!< LDOVREF (Bitfield-Mask: 0x07)                         */
#define RAC_RFBIASCTRL_LDOAMPCURR_Pos     (4UL)                     /*!< LDOAMPCURR (Bit 4)                                    */
#define RAC_RFBIASCTRL_LDOAMPCURR_Msk     (0x70UL)                  /*!< LDOAMPCURR (Bitfield-Mask: 0x07)                      */
#define RAC_RFBIASCTRL_STARTUPSUPPLY_Pos  (16UL)                    /*!< STARTUPSUPPLY (Bit 16)                                */
#define RAC_RFBIASCTRL_STARTUPSUPPLY_Msk  (0x10000UL)               /*!< STARTUPSUPPLY (Bitfield-Mask: 0x01)                   */
#define RAC_RFBIASCTRL_STARTUPCORE_Pos    (17UL)                    /*!< STARTUPCORE (Bit 17)                                  */
#define RAC_RFBIASCTRL_STARTUPCORE_Msk    (0x20000UL)               /*!< STARTUPCORE (Bitfield-Mask: 0x01)                     */
#define RAC_RFBIASCTRL_DISBOOTSTRAP_Pos   (18UL)                    /*!< DISBOOTSTRAP (Bit 18)                                 */
#define RAC_RFBIASCTRL_DISBOOTSTRAP_Msk   (0x40000UL)               /*!< DISBOOTSTRAP (Bitfield-Mask: 0x01)                    */
/* =======================================================  RFBIASCAL  ======================================================= */
#define RAC_RFBIASCAL_VREF_Pos            (0UL)                     /*!< VREF (Bit 0)                                          */
#define RAC_RFBIASCAL_VREF_Msk            (0x3fUL)                  /*!< VREF (Bitfield-Mask: 0x3f)                            */
#define RAC_RFBIASCAL_BIAS_Pos            (8UL)                     /*!< BIAS (Bit 8)                                          */
#define RAC_RFBIASCAL_BIAS_Msk            (0x3f00UL)                /*!< BIAS (Bitfield-Mask: 0x3f)                            */
#define RAC_RFBIASCAL_TEMPCO_Pos          (16UL)                    /*!< TEMPCO (Bit 16)                                       */
#define RAC_RFBIASCAL_TEMPCO_Msk          (0x3f0000UL)              /*!< TEMPCO (Bitfield-Mask: 0x3f)                          */
/* ======================================================  LNAMIXCTRL1  ====================================================== */
#define RAC_LNAMIXCTRL1_TRIMAUXPLLCLK_Pos (1UL)                     /*!< TRIMAUXPLLCLK (Bit 1)                                 */
#define RAC_LNAMIXCTRL1_TRIMAUXPLLCLK_Msk (0x1eUL)                  /*!< TRIMAUXPLLCLK (Bitfield-Mask: 0x0f)                   */
#define RAC_LNAMIXCTRL1_TRIMTRSWGATEV_Pos (5UL)                     /*!< TRIMTRSWGATEV (Bit 5)                                 */
#define RAC_LNAMIXCTRL1_TRIMTRSWGATEV_Msk (0x60UL)                  /*!< TRIMTRSWGATEV (Bitfield-Mask: 0x03)                   */
#define RAC_LNAMIXCTRL1_TRIMVCASLDO_Pos   (7UL)                     /*!< TRIMVCASLDO (Bit 7)                                   */
#define RAC_LNAMIXCTRL1_TRIMVCASLDO_Msk   (0x80UL)                  /*!< TRIMVCASLDO (Bitfield-Mask: 0x01)                     */
#define RAC_LNAMIXCTRL1_TRIMVREFLDO_Pos   (8UL)                     /*!< TRIMVREFLDO (Bit 8)                                   */
#define RAC_LNAMIXCTRL1_TRIMVREFLDO_Msk   (0x700UL)                 /*!< TRIMVREFLDO (Bitfield-Mask: 0x07)                     */
#define RAC_LNAMIXCTRL1_TRIMVREGMIN_Pos   (11UL)                    /*!< TRIMVREGMIN (Bit 11)                                  */
#define RAC_LNAMIXCTRL1_TRIMVREGMIN_Msk   (0x1800UL)                /*!< TRIMVREGMIN (Bitfield-Mask: 0x03)                     */
#define RAC_LNAMIXCTRL1_TRIMAUXBIAS_Pos   (13UL)                    /*!< TRIMAUXBIAS (Bit 13)                                  */
#define RAC_LNAMIXCTRL1_TRIMAUXBIAS_Msk   (0x6000UL)                /*!< TRIMAUXBIAS (Bitfield-Mask: 0x03)                     */
#define RAC_LNAMIXCTRL1_ENBIASCAL_Pos     (15UL)                    /*!< ENBIASCAL (Bit 15)                                    */
#define RAC_LNAMIXCTRL1_ENBIASCAL_Msk     (0x8000UL)                /*!< ENBIASCAL (Bitfield-Mask: 0x01)                       */
#define RAC_LNAMIXCTRL1_STATUSBIASCAL_Pos (16UL)                    /*!< STATUSBIASCAL (Bit 16)                                */
#define RAC_LNAMIXCTRL1_STATUSBIASCAL_Msk (0x10000UL)               /*!< STATUSBIASCAL (Bitfield-Mask: 0x01)                   */
#define RAC_LNAMIXCTRL1_TRIMAUXPLLGAIN_Pos (17UL)                   /*!< TRIMAUXPLLGAIN (Bit 17)                               */
#define RAC_LNAMIXCTRL1_TRIMAUXPLLGAIN_Msk (0x1e0000UL)             /*!< TRIMAUXPLLGAIN (Bitfield-Mask: 0x0f)                  */
#define RAC_LNAMIXCTRL1_TRIMLDOAMPBWRED_Pos (21UL)                  /*!< TRIMLDOAMPBWRED (Bit 21)                              */
#define RAC_LNAMIXCTRL1_TRIMLDOAMPBWRED_Msk (0x600000UL)            /*!< TRIMLDOAMPBWRED (Bitfield-Mask: 0x03)                 */
/* =======================================================  IFPGACTRL  ======================================================= */
#define RAC_IFPGACTRL_VLDO_Pos            (1UL)                     /*!< VLDO (Bit 1)                                          */
#define RAC_IFPGACTRL_VLDO_Msk            (0xeUL)                   /*!< VLDO (Bitfield-Mask: 0x07)                            */
#define RAC_IFPGACTRL_BANDSEL_Pos         (4UL)                     /*!< BANDSEL (Bit 4)                                       */
#define RAC_IFPGACTRL_BANDSEL_Msk         (0x10UL)                  /*!< BANDSEL (Bitfield-Mask: 0x01)                         */
#define RAC_IFPGACTRL_CASCBIAS_Pos        (5UL)                     /*!< CASCBIAS (Bit 5)                                      */
#define RAC_IFPGACTRL_CASCBIAS_Msk        (0xe0UL)                  /*!< CASCBIAS (Bitfield-Mask: 0x07)                        */
#define RAC_IFPGACTRL_TRIMVCASLDO_Pos     (8UL)                     /*!< TRIMVCASLDO (Bit 8)                                   */
#define RAC_IFPGACTRL_TRIMVCASLDO_Msk     (0x100UL)                 /*!< TRIMVCASLDO (Bitfield-Mask: 0x01)                     */
#define RAC_IFPGACTRL_TRIMVCM_Pos         (9UL)                     /*!< TRIMVCM (Bit 9)                                       */
#define RAC_IFPGACTRL_TRIMVCM_Msk         (0xe00UL)                 /*!< TRIMVCM (Bitfield-Mask: 0x07)                         */
#define RAC_IFPGACTRL_TRIMVREFLDO_Pos     (12UL)                    /*!< TRIMVREFLDO (Bit 12)                                  */
#define RAC_IFPGACTRL_TRIMVREFLDO_Msk     (0x7000UL)                /*!< TRIMVREFLDO (Bitfield-Mask: 0x07)                     */
#define RAC_IFPGACTRL_TRIMVREGMIN_Pos     (15UL)                    /*!< TRIMVREGMIN (Bit 15)                                  */
#define RAC_IFPGACTRL_TRIMVREGMIN_Msk     (0x18000UL)               /*!< TRIMVREGMIN (Bitfield-Mask: 0x03)                     */
#define RAC_IFPGACTRL_ENHYST_Pos          (17UL)                    /*!< ENHYST (Bit 17)                                       */
#define RAC_IFPGACTRL_ENHYST_Msk          (0x20000UL)               /*!< ENHYST (Bitfield-Mask: 0x01)                          */
#define RAC_IFPGACTRL_ENOFFD_Pos          (18UL)                    /*!< ENOFFD (Bit 18)                                       */
#define RAC_IFPGACTRL_ENOFFD_Msk          (0x40000UL)               /*!< ENOFFD (Bitfield-Mask: 0x01)                          */
/* =======================================================  IFPGACAL  ======================================================== */
#define RAC_IFPGACAL_IRAMP_Pos            (0UL)                     /*!< IRAMP (Bit 0)                                         */
#define RAC_IFPGACAL_IRAMP_Msk            (0x7fUL)                  /*!< IRAMP (Bitfield-Mask: 0x7f)                           */
#define RAC_IFPGACAL_IRPHASE_Pos          (8UL)                     /*!< IRPHASE (Bit 8)                                       */
#define RAC_IFPGACAL_IRPHASE_Msk          (0x7f00UL)                /*!< IRPHASE (Bitfield-Mask: 0x7f)                         */
#define RAC_IFPGACAL_OFFSETI_Pos          (16UL)                    /*!< OFFSETI (Bit 16)                                      */
#define RAC_IFPGACAL_OFFSETI_Msk          (0x7f0000UL)              /*!< OFFSETI (Bitfield-Mask: 0x7f)                         */
#define RAC_IFPGACAL_OFFSETQ_Pos          (24UL)                    /*!< OFFSETQ (Bit 24)                                      */
#define RAC_IFPGACAL_OFFSETQ_Msk          (0x7f000000UL)            /*!< OFFSETQ (Bitfield-Mask: 0x7f)                         */
/* ======================================================  IFFILTCTRL  ======================================================= */
#define RAC_IFFILTCTRL_BANDWIDTH_Pos      (0UL)                     /*!< BANDWIDTH (Bit 0)                                     */
#define RAC_IFFILTCTRL_BANDWIDTH_Msk      (0xfUL)                   /*!< BANDWIDTH (Bitfield-Mask: 0x0f)                       */
#define RAC_IFFILTCTRL_CENTFREQ_Pos       (5UL)                     /*!< CENTFREQ (Bit 5)                                      */
#define RAC_IFFILTCTRL_CENTFREQ_Msk       (0xe0UL)                  /*!< CENTFREQ (Bitfield-Mask: 0x07)                        */
#define RAC_IFFILTCTRL_VCM_Pos            (18UL)                    /*!< VCM (Bit 18)                                          */
#define RAC_IFFILTCTRL_VCM_Msk            (0xc0000UL)               /*!< VCM (Bitfield-Mask: 0x03)                             */
#define RAC_IFFILTCTRL_VREG_Pos           (21UL)                    /*!< VREG (Bit 21)                                         */
#define RAC_IFFILTCTRL_VREG_Msk           (0xe00000UL)              /*!< VREG (Bitfield-Mask: 0x07)                            */
#define RAC_IFFILTCTRL_DROOP_Pos          (25UL)                    /*!< DROOP (Bit 25)                                        */
#define RAC_IFFILTCTRL_DROOP_Msk          (0x6000000UL)             /*!< DROOP (Bitfield-Mask: 0x03)                           */
#define RAC_IFFILTCTRL_INPUTSHORT_Pos     (31UL)                    /*!< INPUTSHORT (Bit 31)                                   */
#define RAC_IFFILTCTRL_INPUTSHORT_Msk     (0x80000000UL)            /*!< INPUTSHORT (Bitfield-Mask: 0x01)                      */
/* =======================================================  IFADCCTRL  ======================================================= */
#define RAC_IFADCCTRL_REALMODE_Pos        (0UL)                     /*!< REALMODE (Bit 0)                                      */
#define RAC_IFADCCTRL_REALMODE_Msk        (0x1UL)                   /*!< REALMODE (Bitfield-Mask: 0x01)                        */
#define RAC_IFADCCTRL_INPUTSEL_Pos        (1UL)                     /*!< INPUTSEL (Bit 1)                                      */
#define RAC_IFADCCTRL_INPUTSEL_Msk        (0x2UL)                   /*!< INPUTSEL (Bitfield-Mask: 0x01)                        */
#define RAC_IFADCCTRL_INPUTSCALE_Pos      (2UL)                     /*!< INPUTSCALE (Bit 2)                                    */
#define RAC_IFADCCTRL_INPUTSCALE_Msk      (0xcUL)                   /*!< INPUTSCALE (Bitfield-Mask: 0x03)                      */
#define RAC_IFADCCTRL_SHORTI_Pos          (4UL)                     /*!< SHORTI (Bit 4)                                        */
#define RAC_IFADCCTRL_SHORTI_Msk          (0x10UL)                  /*!< SHORTI (Bitfield-Mask: 0x01)                          */
#define RAC_IFADCCTRL_SHORTQ_Pos          (5UL)                     /*!< SHORTQ (Bit 5)                                        */
#define RAC_IFADCCTRL_SHORTQ_Msk          (0x20UL)                  /*!< SHORTQ (Bitfield-Mask: 0x01)                          */
#define RAC_IFADCCTRL_VLDOSERIES_Pos      (6UL)                     /*!< VLDOSERIES (Bit 6)                                    */
#define RAC_IFADCCTRL_VLDOSERIES_Msk      (0x1c0UL)                 /*!< VLDOSERIES (Bitfield-Mask: 0x07)                      */
#define RAC_IFADCCTRL_VLDOSERIESCURR_Pos  (9UL)                     /*!< VLDOSERIESCURR (Bit 9)                                */
#define RAC_IFADCCTRL_VLDOSERIESCURR_Msk  (0xe00UL)                 /*!< VLDOSERIESCURR (Bitfield-Mask: 0x07)                  */
#define RAC_IFADCCTRL_VLDOSHUNT_Pos       (12UL)                    /*!< VLDOSHUNT (Bit 12)                                    */
#define RAC_IFADCCTRL_VLDOSHUNT_Msk       (0x3000UL)                /*!< VLDOSHUNT (Bitfield-Mask: 0x03)                       */
#define RAC_IFADCCTRL_VLDOCLKGEN_Pos      (14UL)                    /*!< VLDOCLKGEN (Bit 14)                                   */
#define RAC_IFADCCTRL_VLDOCLKGEN_Msk      (0xc000UL)                /*!< VLDOCLKGEN (Bitfield-Mask: 0x03)                      */
#define RAC_IFADCCTRL_VCM_Pos             (16UL)                    /*!< VCM (Bit 16)                                          */
#define RAC_IFADCCTRL_VCM_Msk             (0x70000UL)               /*!< VCM (Bitfield-Mask: 0x07)                             */
#define RAC_IFADCCTRL_OTA1CURRENT_Pos     (19UL)                    /*!< OTA1CURRENT (Bit 19)                                  */
#define RAC_IFADCCTRL_OTA1CURRENT_Msk     (0x180000UL)              /*!< OTA1CURRENT (Bitfield-Mask: 0x03)                     */
#define RAC_IFADCCTRL_OTA2CURRENT_Pos     (21UL)                    /*!< OTA2CURRENT (Bit 21)                                  */
#define RAC_IFADCCTRL_OTA2CURRENT_Msk     (0x600000UL)              /*!< OTA2CURRENT (Bitfield-Mask: 0x03)                     */
#define RAC_IFADCCTRL_OTA3CURRENT_Pos     (23UL)                    /*!< OTA3CURRENT (Bit 23)                                  */
#define RAC_IFADCCTRL_OTA3CURRENT_Msk     (0x1800000UL)             /*!< OTA3CURRENT (Bitfield-Mask: 0x03)                     */
#define RAC_IFADCCTRL_SATURATIONDETDIS_Pos (25UL)                   /*!< SATURATIONDETDIS (Bit 25)                             */
#define RAC_IFADCCTRL_SATURATIONDETDIS_Msk (0x2000000UL)            /*!< SATURATIONDETDIS (Bitfield-Mask: 0x01)                */
#define RAC_IFADCCTRL_REGENCLKDELAY_Pos   (26UL)                    /*!< REGENCLKDELAY (Bit 26)                                */
#define RAC_IFADCCTRL_REGENCLKDELAY_Msk   (0x1c000000UL)            /*!< REGENCLKDELAY (Bitfield-Mask: 0x07)                   */
#define RAC_IFADCCTRL_ENABLECLK_Pos       (29UL)                    /*!< ENABLECLK (Bit 29)                                    */
#define RAC_IFADCCTRL_ENABLECLK_Msk       (0x20000000UL)            /*!< ENABLECLK (Bitfield-Mask: 0x01)                       */
#define RAC_IFADCCTRL_INVERTCLK_Pos       (30UL)                    /*!< INVERTCLK (Bit 30)                                    */
#define RAC_IFADCCTRL_INVERTCLK_Msk       (0x40000000UL)            /*!< INVERTCLK (Bitfield-Mask: 0x01)                       */
/* =======================================================  IFADCCAL  ======================================================== */
#define RAC_IFADCCAL_CALEN_Pos            (4UL)                     /*!< CALEN (Bit 4)                                         */
#define RAC_IFADCCAL_CALEN_Msk            (0x10UL)                  /*!< CALEN (Bitfield-Mask: 0x01)                           */
#define RAC_IFADCCAL_RCCALOUT_Pos         (5UL)                     /*!< RCCALOUT (Bit 5)                                      */
#define RAC_IFADCCAL_RCCALOUT_Msk         (0x20UL)                  /*!< RCCALOUT (Bitfield-Mask: 0x01)                        */
/* =======================================================  PAENCTRL  ======================================================== */
#define RAC_PAENCTRL_PACTUNEN_Pos         (2UL)                     /*!< PACTUNEN (Bit 2)                                      */
#define RAC_PAENCTRL_PACTUNEN_Msk         (0x4UL)                   /*!< PACTUNEN (Bitfield-Mask: 0x01)                        */
#define RAC_PAENCTRL_PARAMP_Pos           (8UL)                     /*!< PARAMP (Bit 8)                                        */
#define RAC_PAENCTRL_PARAMP_Msk           (0x100UL)                 /*!< PARAMP (Bitfield-Mask: 0x01)                          */
/* ======================================================  PACTUNECTRL  ====================================================== */
#define RAC_PACTUNECTRL_PACTUNE_Pos       (0UL)                     /*!< PACTUNE (Bit 0)                                       */
#define RAC_PACTUNECTRL_PACTUNE_Msk       (0x7UL)                   /*!< PACTUNE (Bitfield-Mask: 0x07)                         */
#define RAC_PACTUNECTRL_SGPACTUNE_Pos     (4UL)                     /*!< SGPACTUNE (Bit 4)                                     */
#define RAC_PACTUNECTRL_SGPACTUNE_Msk     (0x1f0UL)                 /*!< SGPACTUNE (Bitfield-Mask: 0x1f)                       */
/* ========================================================  RCTUNE  ========================================================= */
#define RAC_RCTUNE_IFADCRCTUNE_Pos        (0UL)                     /*!< IFADCRCTUNE (Bit 0)                                   */
#define RAC_RCTUNE_IFADCRCTUNE_Msk        (0x3fUL)                  /*!< IFADCRCTUNE (Bitfield-Mask: 0x3f)                     */
#define RAC_RCTUNE_IFFILT_Pos             (16UL)                    /*!< IFFILT (Bit 16)                                       */
#define RAC_RCTUNE_IFFILT_Msk             (0x3f0000UL)              /*!< IFFILT (Bitfield-Mask: 0x3f)                          */
/* ==========================================================  APC  ========================================================== */
#define RAC_APC_ENPASTATUSVDDPA_Pos       (0UL)                     /*!< ENPASTATUSVDDPA (Bit 0)                               */
#define RAC_APC_ENPASTATUSVDDPA_Msk       (0x1UL)                   /*!< ENPASTATUSVDDPA (Bitfield-Mask: 0x01)                 */
#define RAC_APC_ENPASTATUSPKDVTH_Pos      (1UL)                     /*!< ENPASTATUSPKDVTH (Bit 1)                              */
#define RAC_APC_ENPASTATUSPKDVTH_Msk      (0x2UL)                   /*!< ENPASTATUSPKDVTH (Bitfield-Mask: 0x01)                */
#define RAC_APC_ENAPCSW_Pos               (2UL)                     /*!< ENAPCSW (Bit 2)                                       */
#define RAC_APC_ENAPCSW_Msk               (0x4UL)                   /*!< ENAPCSW (Bitfield-Mask: 0x01)                         */
#define RAC_APC_AMPCONTROLLIMITSW_Pos     (24UL)                    /*!< AMPCONTROLLIMITSW (Bit 24)                            */
#define RAC_APC_AMPCONTROLLIMITSW_Msk     (0xff000000UL)            /*!< AMPCONTROLLIMITSW (Bitfield-Mask: 0xff)               */
/* =========================================================  SPARE  ========================================================= */
#define RAC_SPARE_SYNTHSPARE_Pos          (0UL)                     /*!< SYNTHSPARE (Bit 0)                                    */
#define RAC_SPARE_SYNTHSPARE_Msk          (0xffUL)                  /*!< SYNTHSPARE (Bitfield-Mask: 0xff)                      */
#define RAC_SPARE_LNAMIXERSPARE_Pos       (8UL)                     /*!< LNAMIXERSPARE (Bit 8)                                 */
#define RAC_SPARE_LNAMIXERSPARE_Msk       (0x300UL)                 /*!< LNAMIXERSPARE (Bitfield-Mask: 0x03)                   */
#define RAC_SPARE_IFFILTSPARE_Pos         (10UL)                    /*!< IFFILTSPARE (Bit 10)                                  */
#define RAC_SPARE_IFFILTSPARE_Msk         (0x1c00UL)                /*!< IFFILTSPARE (Bitfield-Mask: 0x07)                     */
#define RAC_SPARE_IFPGASPARE_Pos          (13UL)                    /*!< IFPGASPARE (Bit 13)                                   */
#define RAC_SPARE_IFPGASPARE_Msk          (0x6000UL)                /*!< IFPGASPARE (Bitfield-Mask: 0x03)                      */
#define RAC_SPARE_IFFILTSPARE0_Pos        (15UL)                    /*!< IFFILTSPARE0 (Bit 15)                                 */
#define RAC_SPARE_IFFILTSPARE0_Msk        (0x18000UL)               /*!< IFFILTSPARE0 (Bitfield-Mask: 0x03)                    */
#define RAC_SPARE_IFFILTSPARE1_Pos        (17UL)                    /*!< IFFILTSPARE1 (Bit 17)                                 */
