VDowbensky/efr32_baremetal/baremetal_test/chip/efr32fg1v_rac.h
#define RAC_SPARE_IFFILTSPARE1_Msk        (0x60000UL)               /*!< IFFILTSPARE1 (Bitfield-Mask: 0x03)                    */
#define RAC_SPARE_IFFILTSPARE2_Pos        (19UL)                    /*!< IFFILTSPARE2 (Bit 19)                                 */
#define RAC_SPARE_IFFILTSPARE2_Msk        (0x180000UL)              /*!< IFFILTSPARE2 (Bitfield-Mask: 0x03)                    */
#define RAC_SPARE_IFADCSPARE_Pos          (21UL)                    /*!< IFADCSPARE (Bit 21)                                   */
#define RAC_SPARE_IFADCSPARE_Msk          (0xe00000UL)              /*!< IFADCSPARE (Bitfield-Mask: 0x07)                      */
#define RAC_SPARE_PASPARE_Pos             (24UL)                    /*!< PASPARE (Bit 24)                                      */
#define RAC_SPARE_PASPARE_Msk             (0x7000000UL)             /*!< PASPARE (Bitfield-Mask: 0x07)                         */
#define RAC_SPARE_SGPASPARE_Pos           (27UL)                    /*!< SGPASPARE (Bit 27)                                    */
#define RAC_SPARE_SGPASPARE_Msk           (0x38000000UL)            /*!< SGPASPARE (Bitfield-Mask: 0x07)                       */
#define RAC_SPARE_SGLNAMIXSPARE_Pos       (30UL)                    /*!< SGLNAMIXSPARE (Bit 30)                                */
#define RAC_SPARE_SGLNAMIXSPARE_Msk       (0xc0000000UL)            /*!< SGLNAMIXSPARE (Bitfield-Mask: 0x03)                   */


/** @} */
/** @} End of group EFR32FG1V_RAC */
/** @} End of group Parts */
